{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"conv1d_input:0": {"name": "conv1d_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "61"}, {"size": "64"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1d_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "61"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/enter/_244", "op": "Enter", "input": ["unknown_10"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8zL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/enter/_245", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/unstack-folded-0"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8zL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/enter/_246", "op": "Enter", "input": ["unknown_11"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8zL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/enter/_247", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/unstack-folded-1"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8zL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/enter/_239", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8zL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/enter/_184", "op": "Enter", "input": ["unknown_7"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8yL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/enter/_185", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/unstack-folded-0"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8yL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/enter/_186", "op": "Enter", "input": ["unknown_8"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8yL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/enter/_187", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/unstack-folded-1"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8yL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/enter/_179", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8yL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/enter/_124", "op": "Enter", "input": ["unknown_4"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/enter/_125", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/unstack-folded-0"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/enter/_126", "op": "Enter", "input": ["unknown_5"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/enter/_127", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/unstack-folded-1"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/enter/_119", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_64", "op": "Enter", "input": ["unknown_1"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_65", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/unstack-folded-0"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_66", "op": "Enter", "input": ["unknown_2"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_67", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/unstack-folded-1"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_59", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_57", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/loop_counter"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/enter/_117", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/enter/_177", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8yL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/enter/_237", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydV8zL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["conv1d_input", "StatefulPartitionedCall/sequential_2/conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/merge/_255", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/enter/_244", "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/next_iteration/_291"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/merge/_256", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/enter/_245", "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/next_iteration/_292"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/merge/_257", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/enter/_246", "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/next_iteration/_293"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/merge/_258", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/enter/_247", "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/next_iteration/_294"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/merge/_250", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/enter/_239", "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/next_iteration/_286"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/merge/_195", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/enter/_184", "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/next_iteration/_231"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/merge/_196", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/enter/_185", "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/next_iteration/_232"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/merge/_197", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/enter/_186", "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/next_iteration/_233"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/merge/_198", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/enter/_187", "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/next_iteration/_234"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/merge/_190", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/enter/_179", "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/next_iteration/_226"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/merge/_135", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/enter/_124", "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/next_iteration/_171"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/merge/_136", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/enter/_125", "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/next_iteration/_172"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/merge/_137", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/enter/_126", "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/next_iteration/_173"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/merge/_138", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/enter/_127", "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/next_iteration/_174"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/merge/_130", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/enter/_119", "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/next_iteration/_166"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_75", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_64", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/next_iteration/_111"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_76", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_65", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/next_iteration/_112"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_77", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_66", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/next_iteration/_113"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_78", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_67", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/next_iteration/_114"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_70", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_59", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/next_iteration/_106"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_68", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_57", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/next_iteration/_104"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/merge/_128", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/enter/_117", "StatefulPartitionedCall/sequential_2/gru_1/PartitionedCall/while/next_iteration/_164"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/merge/_188", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/enter/_177", "StatefulPartitionedCall/sequential_2/gru_2/PartitionedCall/while/next_iteration/_224"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/merge/_248", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/enter/_237", "StatefulPartitionedCall/sequential_2/gru_3/PartitionedCall/while/next_iteration/_284"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2/conv1d/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_2/conv1d/conv1d/ExpandDims_1", "unknown_0"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv1d/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2/conv1d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/conv1d/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2/conv1d/Relu", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/gru/Shape", "StatefulPartitionedCall/sequential_2/gru/strided_slice/stack", "StatefulPartitionedCall/sequential_2/gru/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/gru/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/gru/strided_slice", "StatefulPartitionedCall/sequential_2/gru/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_63", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2/gru/zeros/packed", "StatefulPartitionedCall/sequential_2/gru/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_74", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_63", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/next_iteration/_110"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_62", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_61", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/gru/zeros"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_60", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayV2_1"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_73", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_62", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/next_iteration/_109"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_72", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_61", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/next_iteration/_108"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_71", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/enter/_60", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/next_iteration/_107"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/cond/_55/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_70", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_73", "^StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_68"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/LoopCond/_79", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/cond/_55/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_86", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_74", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/input/_21_switch/_87", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_75", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/unstack_switch/_88", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_76", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/input/_20_switch/_84", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_72", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/input/_22_switch/_89", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_77", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/unstack_switch/_90", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_78", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/time_switch/_82", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_70", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/loop_counter_switch/_80", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_68", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayV2_1_switch/_83", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_71", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/strided_slice_switch/_85", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/merge/_73", "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/loop_body_control/_91", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/loop_counter_switch/_80:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/exit/_95", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayV2_1_switch/_83"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/body/_56/while/sub/x", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/loop_body_control/_91"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/body/_56/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/loop_body_control/_91"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/next_iteration/_110", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_86:1", "^StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/loop_body_control/_91"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/body/_56/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/loop_body_control/_91"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/next_iteration/_111", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/gru/PartitionedCall/input/_21_switch/_87:1", "^StatefulPartitionedCall/sequential_2/gru/PartitionedCall/while/loop_body_control/_91"], "attr": {"T": {"type": "DT_FLOAT"}}}, 