Model: "sequential_56"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_22 (Conv1D)           (None, 29, 64)            20544     
_________________________________________________________________
bidirectional_48 (Bidirectio (None, 29, 128)           49920     
_________________________________________________________________
bidirectional_49 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_22 (Dense)             (None, 1)                 129       
=================================================================
Total params: 145,089
Trainable params: 145,089
Non-trainable params: 0
_________________________________________________________________
