Model: "sequential_119"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 122, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 122, 128)          0         
_________________________________________________________________
conv1d_41 (Conv1D)           (None, 41, 32)            4128      
_________________________________________________________________
lstm_38 (LSTM)               (None, 64)                24832     
_________________________________________________________________
dense_40 (Dense)             (None, 1)                 65        
=================================================================
Total params: 29,025
Trainable params: 29,025
Non-trainable params: 0
_________________________________________________________________
