Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 1000, 16)          0         
_________________________________________________________________
conv1d (Conv1D)              (None, 489, 32)           12320     
_________________________________________________________________
bidirectional (Bidirectional (None, 489, 64)           12672     
_________________________________________________________________
bidirectional_1 (Bidirection (None, 64)                18816     
_________________________________________________________________
dense (Dense)                (None, 1)                 65        
=================================================================
Total params: 43,873
Trainable params: 43,873
Non-trainable params: 0
_________________________________________________________________
