Model: "sequential_90"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_30 (Conv1D)           (None, 31, 32)            2080      
_________________________________________________________________
bidirectional_38 (Bidirectio (None, 31, 128)           37632     
_________________________________________________________________
bidirectional_39 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_30 (Dense)             (None, 1)                 129       
=================================================================
Total params: 114,337
Trainable params: 114,337
Non-trainable params: 0
_________________________________________________________________
