Model: "sequential_27"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 31, 64)            4160      
_________________________________________________________________
gru_29 (GRU)                 (None, 31, 128)           74496     
_________________________________________________________________
gru_30 (GRU)                 (None, 31, 128)           99072     
_________________________________________________________________
gru_31 (GRU)                 (None, 31, 128)           99072     
_________________________________________________________________
gru_32 (GRU)                 (None, 128)               99072     
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 129       
=================================================================
Total params: 376,001
Trainable params: 376,001
Non-trainable params: 0
_________________________________________________________________
