Model: "sequential_92"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 64)           0         
_________________________________________________________________
conv1d_32 (Conv1D)           (None, 121, 32)           10272     
_________________________________________________________________
bidirectional_30 (Bidirectio (None, 121, 128)          49664     
_________________________________________________________________
bidirectional_31 (Bidirectio (None, 121, 128)          98816     
_________________________________________________________________
bidirectional_32 (Bidirectio (None, 121, 128)          98816     
_________________________________________________________________
bidirectional_33 (Bidirectio (None, 128)               98816     
_________________________________________________________________
dense_31 (Dense)             (None, 1)                 129       
=================================================================
Total params: 356,513
Trainable params: 356,513
Non-trainable params: 0
_________________________________________________________________
