Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d (Conv1D)              (None, 31, 32)            2080      
_________________________________________________________________
gru (GRU)                    (None, 31, 128)           62208     
_________________________________________________________________
gru_1 (GRU)                  (None, 31, 128)           99072     
_________________________________________________________________
gru_2 (GRU)                  (None, 31, 128)           99072     
_________________________________________________________________
gru_3 (GRU)                  (None, 128)               99072     
_________________________________________________________________
dense (Dense)                (None, 1)                 129       
=================================================================
Total params: 361,633
Trainable params: 361,633
Non-trainable params: 0
_________________________________________________________________
