Model: "sequential_104"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 16)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 16)            0         
_________________________________________________________________
conv1d_36 (Conv1D)           (None, 31, 64)            1088      
_________________________________________________________________
bidirectional_38 (Bidirectio (None, 31, 128)           49920     
_________________________________________________________________
bidirectional_39 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_35 (Dense)             (None, 1)                 129       
=================================================================
Total params: 125,633
Trainable params: 125,633
Non-trainable params: 0
_________________________________________________________________
