Model: "sequential_66"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_22 (Conv1D)           (None, 57, 64)            20544     
_________________________________________________________________
gru_69 (GRU)                 (None, 57, 64)            24960     
_________________________________________________________________
gru_70 (GRU)                 (None, 57, 64)            24960     
_________________________________________________________________
gru_71 (GRU)                 (None, 57, 64)            24960     
_________________________________________________________________
gru_72 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_22 (Dense)             (None, 1)                 65        
=================================================================
Total params: 120,449
Trainable params: 120,449
Non-trainable params: 0
_________________________________________________________________
