Model: "sequential_38"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 16)           0         
_________________________________________________________________
conv1d_14 (Conv1D)           (None, 123, 64)           3136      
_________________________________________________________________
bidirectional_18 (Bidirectio (None, 123, 256)          197632    
_________________________________________________________________
bidirectional_19 (Bidirectio (None, 256)               394240    
_________________________________________________________________
dense_13 (Dense)             (None, 1)                 257       
=================================================================
Total params: 595,265
Trainable params: 595,265
Non-trainable params: 0
_________________________________________________________________
