Model: "sequential_122"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 128)          0         
_________________________________________________________________
conv1d_42 (Conv1D)           (None, 122, 64)           24640     
_________________________________________________________________
bidirectional_43 (Bidirectio (None, 122, 256)          148992    
_________________________________________________________________
bidirectional_44 (Bidirectio (None, 122, 256)          296448    
_________________________________________________________________
bidirectional_45 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_41 (Dense)             (None, 1)                 257       
=================================================================
Total params: 766,785
Trainable params: 766,785
Non-trainable params: 0
_________________________________________________________________
