Model: "sequential_131"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 59, 16)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 59, 16)            0         
_________________________________________________________________
conv1d_45 (Conv1D)           (None, 29, 32)            1568      
_________________________________________________________________
bidirectional_54 (Bidirectio (None, 29, 128)           49664     
_________________________________________________________________
bidirectional_55 (Bidirectio (None, 29, 128)           98816     
_________________________________________________________________
bidirectional_56 (Bidirectio (None, 29, 128)           98816     
_________________________________________________________________
bidirectional_57 (Bidirectio (None, 128)               98816     
_________________________________________________________________
dense_44 (Dense)             (None, 1)                 129       
=================================================================
Total params: 347,809
Trainable params: 347,809
Non-trainable params: 0
_________________________________________________________________
