Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d (Conv1D)              (None, 19, 64)            20544     
_________________________________________________________________
gru (GRU)                    (None, 19, 128)           74496     
_________________________________________________________________
gru_1 (GRU)                  (None, 128)               99072     
_________________________________________________________________
dense (Dense)                (None, 1)                 129       
=================================================================
Total params: 194,241
Trainable params: 194,241
Non-trainable params: 0
_________________________________________________________________
