Model: "sequential_65"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 31, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 31, 64)            0         
_________________________________________________________________
conv1d_23 (Conv1D)           (None, 29, 32)            6176      
_________________________________________________________________
gru_29 (GRU)                 (None, 29, 32)            6336      
_________________________________________________________________
gru_30 (GRU)                 (None, 29, 32)            6336      
_________________________________________________________________
gru_31 (GRU)                 (None, 29, 32)            6336      
_________________________________________________________________
gru_32 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_22 (Dense)             (None, 1)                 33        
=================================================================
Total params: 31,553
Trainable params: 31,553
Non-trainable params: 0
_________________________________________________________________
