Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d (Conv1D)              (None, 20, 32)            6176      
_________________________________________________________________
bidirectional (Bidirectional (None, 20, 256)           124416    
_________________________________________________________________
bidirectional_1 (Bidirection (None, 20, 256)           296448    
_________________________________________________________________
bidirectional_2 (Bidirection (None, 20, 256)           296448    
_________________________________________________________________
bidirectional_3 (Bidirection (None, 256)               296448    
_________________________________________________________________
dense (Dense)                (None, 1)                 257       
=================================================================
Total params: 1,020,193
Trainable params: 1,020,193
Non-trainable params: 0
_________________________________________________________________
