Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_3 (Reshape)          (None, 1600, 10)          0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 529, 64)           9664      
_________________________________________________________________
bidirectional_5 (Bidirection (None, 529, 64)           18816     
_________________________________________________________________
bidirectional_6 (Bidirection (None, 529, 64)           18816     
_________________________________________________________________
bidirectional_7 (Bidirection (None, 64)                18816     
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 65        
=================================================================
Total params: 66,177
Trainable params: 66,177
Non-trainable params: 0
_________________________________________________________________
