Model: "sequential_54"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_18 (Conv1D)           (None, 31, 64)            4160      
_________________________________________________________________
gru_53 (GRU)                 (None, 31, 128)           74496     
_________________________________________________________________
gru_54 (GRU)                 (None, 31, 128)           99072     
_________________________________________________________________
gru_55 (GRU)                 (None, 128)               99072     
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 129       
=================================================================
Total params: 276,929
Trainable params: 276,929
Non-trainable params: 0
_________________________________________________________________
