Model: "sequential_83"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 32)           0         
_________________________________________________________________
conv1d_29 (Conv1D)           (None, 41, 32)            5152      
_________________________________________________________________
gru_37 (GRU)                 (None, 41, 128)           62208     
_________________________________________________________________
gru_38 (GRU)                 (None, 41, 128)           99072     
_________________________________________________________________
gru_39 (GRU)                 (None, 128)               99072     
_________________________________________________________________
dense_28 (Dense)             (None, 1)                 129       
=================================================================
Total params: 265,633
Trainable params: 265,633
Non-trainable params: 0
_________________________________________________________________
