Model: "sequential_32"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 128)          0         
_________________________________________________________________
conv1d_34 (Conv1D)           (None, 61, 32)            12320     
_________________________________________________________________
batch_normalization_29 (Batc (None, 61, 32)            128       
_________________________________________________________________
max_pooling1d_29 (MaxPooling (None, 12, 32)            0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 384)               0         
_________________________________________________________________
dense_27 (Dense)             (None, 64)                24640     
_________________________________________________________________
dropout_18 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_28 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_19 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_29 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_20 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_30 (Dense)             (None, 1)                 17        
=================================================================
Total params: 39,713
Trainable params: 39,649
Non-trainable params: 64
_________________________________________________________________
