Model: "sequential_101"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 122, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 122, 32)           0         
_________________________________________________________________
conv1d_35 (Conv1D)           (None, 40, 32)            3104      
_________________________________________________________________
gru_49 (GRU)                 (None, 40, 64)            18816     
_________________________________________________________________
gru_50 (GRU)                 (None, 40, 64)            24960     
_________________________________________________________________
gru_51 (GRU)                 (None, 40, 64)            24960     
_________________________________________________________________
gru_52 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_34 (Dense)             (None, 1)                 65        
=================================================================
Total params: 96,865
Trainable params: 96,865
Non-trainable params: 0
_________________________________________________________________
