Model: "sequential_185"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 31, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 31, 64)            0         
_________________________________________________________________
conv1d_192 (Conv1D)          (None, 10, 32)            6176      
_________________________________________________________________
batch_normalization_174 (Bat (None, 10, 32)            128       
_________________________________________________________________
max_pooling1d_174 (MaxPoolin (None, 10, 32)            0         
_________________________________________________________________
conv1d_193 (Conv1D)          (None, 3, 64)             6208      
_________________________________________________________________
batch_normalization_175 (Bat (None, 3, 64)             256       
_________________________________________________________________
max_pooling1d_175 (MaxPoolin (None, 3, 64)             0         
_________________________________________________________________
conv1d_194 (Conv1D)          (None, 1, 128)            24704     
_________________________________________________________________
batch_normalization_176 (Bat (None, 1, 128)            512       
_________________________________________________________________
max_pooling1d_176 (MaxPoolin (None, 1, 128)            0         
_________________________________________________________________
flatten_51 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_160 (Dense)            (None, 64)                8256      
_________________________________________________________________
dropout_109 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_161 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_110 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_162 (Dense)            (None, 1)                 33        
=================================================================
Total params: 48,353
Trainable params: 47,905
Non-trainable params: 448
_________________________________________________________________
