Model: "sequential_109"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 16)           0         
_________________________________________________________________
conv1d_119 (Conv1D)          (None, 62, 64)            3136      
_________________________________________________________________
batch_normalization_106 (Bat (None, 62, 64)            256       
_________________________________________________________________
max_pooling1d_106 (MaxPoolin (None, 62, 64)            0         
_________________________________________________________________
conv1d_120 (Conv1D)          (None, 30, 128)           24704     
_________________________________________________________________
batch_normalization_107 (Bat (None, 30, 128)           512       
_________________________________________________________________
max_pooling1d_107 (MaxPoolin (None, 30, 128)           0         
_________________________________________________________________
conv1d_121 (Conv1D)          (None, 14, 256)           98560     
_________________________________________________________________
batch_normalization_108 (Bat (None, 14, 256)           1024      
_________________________________________________________________
max_pooling1d_108 (MaxPoolin (None, 14, 256)           0         
_________________________________________________________________
flatten_29 (Flatten)         (None, 3584)              0         
_________________________________________________________________
dense_96 (Dense)             (None, 64)                229440    
_________________________________________________________________
dropout_67 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_97 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_68 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_98 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_69 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_99 (Dense)             (None, 1)                 17        
=================================================================
Total params: 360,257
Trainable params: 359,361
Non-trainable params: 896
_________________________________________________________________
