Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 128)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 128)           0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 58, 64)            41024     
_________________________________________________________________
batch_normalization_8 (Batch (None, 58, 64)            256       
_________________________________________________________________
max_pooling1d_8 (MaxPooling1 (None, 19, 64)            0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 15, 128)           41088     
_________________________________________________________________
batch_normalization_9 (Batch (None, 15, 128)           512       
_________________________________________________________________
max_pooling1d_9 (MaxPooling1 (None, 5, 128)            0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 640)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 64)                41024     
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 32)                2080      
_________________________________________________________________
dropout_5 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_8 (Dense)              (None, 16)                528       
_________________________________________________________________
dropout_6 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 17        
=================================================================
Total params: 126,529
Trainable params: 126,145
Non-trainable params: 384
_________________________________________________________________
