Model: "sequential_48"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_16 (Conv1D)           (None, 61, 64)            4160      
_________________________________________________________________
bidirectional_16 (Bidirectio (None, 61, 64)            18816     
_________________________________________________________________
bidirectional_17 (Bidirectio (None, 61, 64)            18816     
_________________________________________________________________
bidirectional_18 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 65        
=================================================================
Total params: 60,673
Trainable params: 60,673
Non-trainable params: 0
_________________________________________________________________
