Model: "sequential_21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 21, 32)            2080      
_________________________________________________________________
bidirectional_5 (Bidirection (None, 21, 128)           37632     
_________________________________________________________________
bidirectional_6 (Bidirection (None, 128)               74496     
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 129       
=================================================================
Total params: 114,337
Trainable params: 114,337
Non-trainable params: 0
_________________________________________________________________
