Model: "sequential_39"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_13 (Conv1D)           (None, 59, 32)            6176      
_________________________________________________________________
gru_39 (GRU)                 (None, 59, 64)            18816     
_________________________________________________________________
gru_40 (GRU)                 (None, 59, 64)            24960     
_________________________________________________________________
gru_41 (GRU)                 (None, 59, 64)            24960     
_________________________________________________________________
gru_42 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_13 (Dense)             (None, 1)                 65        
=================================================================
Total params: 99,937
Trainable params: 99,937
Non-trainable params: 0
_________________________________________________________________
