Model: "sequential_24"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 31, 64)            4160      
_________________________________________________________________
gru_26 (GRU)                 (None, 31, 32)            9408      
_________________________________________________________________
gru_27 (GRU)                 (None, 31, 32)            6336      
_________________________________________________________________
gru_28 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 33        
=================================================================
Total params: 26,273
Trainable params: 26,273
Non-trainable params: 0
_________________________________________________________________
