Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 64)           0         
_________________________________________________________________
conv1d_23 (Conv1D)           (None, 61, 64)            20544     
_________________________________________________________________
batch_normalization_19 (Batc (None, 61, 64)            256       
_________________________________________________________________
max_pooling1d_19 (MaxPooling (None, 12, 64)            0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 768)               0         
_________________________________________________________________
dense_18 (Dense)             (None, 64)                49216     
_________________________________________________________________
dropout_12 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_19 (Dense)             (None, 1)                 65        
=================================================================
Total params: 70,081
Trainable params: 69,953
Non-trainable params: 128
_________________________________________________________________
