Model: "sequential_158"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 16)           0         
_________________________________________________________________
conv1d_167 (Conv1D)          (None, 121, 32)           2592      
_________________________________________________________________
batch_normalization_150 (Bat (None, 121, 32)           128       
_________________________________________________________________
max_pooling1d_150 (MaxPoolin (None, 40, 32)            0         
_________________________________________________________________
conv1d_168 (Conv1D)          (None, 36, 64)            10304     
_________________________________________________________________
batch_normalization_151 (Bat (None, 36, 64)            256       
_________________________________________________________________
max_pooling1d_151 (MaxPoolin (None, 12, 64)            0         
_________________________________________________________________
flatten_43 (Flatten)         (None, 768)               0         
_________________________________________________________________
dense_138 (Dense)            (None, 64)                49216     
_________________________________________________________________
dropout_95 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_139 (Dense)            (None, 1)                 65        
=================================================================
Total params: 62,561
Trainable params: 62,369
Non-trainable params: 192
_________________________________________________________________
