Model: "sequential_114"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_38 (Conv1D)           (None, 20, 32)            6176      
_________________________________________________________________
gru_115 (GRU)                (None, 20, 128)           62208     
_________________________________________________________________
gru_116 (GRU)                (None, 128)               99072     
_________________________________________________________________
dense_38 (Dense)             (None, 1)                 129       
=================================================================
Total params: 167,585
Trainable params: 167,585
Non-trainable params: 0
_________________________________________________________________
