Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 500, 32)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 477, 32)           24608     
_________________________________________________________________
gru_4 (GRU)                  (None, 477, 32)           6336      
_________________________________________________________________
gru_5 (GRU)                  (None, 477, 32)           6336      
_________________________________________________________________
gru_6 (GRU)                  (None, 32)                6336      
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 33        
=================================================================
Total params: 43,649
Trainable params: 43,649
Non-trainable params: 0
_________________________________________________________________
