Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_4 (Reshape)          (None, 3200, 5)           0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 3177, 64)          7744      
_________________________________________________________________
gru_11 (GRU)                 (None, 128)               74496     
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 129       
=================================================================
Total params: 82,369
Trainable params: 82,369
Non-trainable params: 0
_________________________________________________________________
