Model: "sequential_59"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_23 (Conv1D)           (None, 19, 64)            20544     
_________________________________________________________________
gru_71 (GRU)                 (None, 19, 128)           74496     
_________________________________________________________________
gru_72 (GRU)                 (None, 19, 128)           99072     
_________________________________________________________________
gru_73 (GRU)                 (None, 128)               99072     
_________________________________________________________________
dense_23 (Dense)             (None, 1)                 129       
=================================================================
Total params: 293,313
Trainable params: 293,313
Non-trainable params: 0
_________________________________________________________________
