Model: "sequential_68"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 128)          0         
_________________________________________________________________
conv1d_24 (Conv1D)           (None, 42, 64)            8256      
_________________________________________________________________
bidirectional_22 (Bidirectio (None, 42, 256)           197632    
_________________________________________________________________
bidirectional_23 (Bidirectio (None, 256)               394240    
_________________________________________________________________
dense_23 (Dense)             (None, 1)                 257       
=================================================================
Total params: 600,385
Trainable params: 600,385
Non-trainable params: 0
_________________________________________________________________
