Model: "sequential_108"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_36 (Conv1D)           (None, 21, 32)            2080      
_________________________________________________________________
bidirectional_48 (Bidirectio (None, 21, 256)           124416    
_________________________________________________________________
bidirectional_49 (Bidirectio (None, 21, 256)           296448    
_________________________________________________________________
bidirectional_50 (Bidirectio (None, 21, 256)           296448    
_________________________________________________________________
bidirectional_51 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_36 (Dense)             (None, 1)                 257       
=================================================================
Total params: 1,016,097
Trainable params: 1,016,097
Non-trainable params: 0
_________________________________________________________________
