Model: "sequential_23"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 30, 128)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 30, 128)           0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 26, 32)            20512     
_________________________________________________________________
bidirectional_9 (Bidirection (None, 128)               37632     
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 129       
=================================================================
Total params: 58,273
Trainable params: 58,273
Non-trainable params: 0
_________________________________________________________________
