Model: "sequential_117"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_39 (Conv1D)           (None, 29, 32)            10272     
_________________________________________________________________
gru_117 (GRU)                (None, 29, 64)            18816     
_________________________________________________________________
gru_118 (GRU)                (None, 64)                24960     
_________________________________________________________________
dense_39 (Dense)             (None, 1)                 65        
=================================================================
Total params: 54,113
Trainable params: 54,113
Non-trainable params: 0
_________________________________________________________________
