Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_2 (Reshape)          (None, 500, 32)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 125, 32)           3104      
_________________________________________________________________
bidirectional_3 (Bidirection (None, 125, 64)           12672     
_________________________________________________________________
bidirectional_4 (Bidirection (None, 64)                18816     
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 65        
=================================================================
Total params: 34,657
Trainable params: 34,657
Non-trainable params: 0
_________________________________________________________________
