Model: "sequential_75"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_25 (Conv1D)           (None, 57, 64)            20544     
_________________________________________________________________
gru_79 (GRU)                 (None, 57, 32)            9408      
_________________________________________________________________
gru_80 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_25 (Dense)             (None, 1)                 33        
=================================================================
Total params: 36,321
Trainable params: 36,321
Non-trainable params: 0
_________________________________________________________________
