Model: "sequential_87"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_29 (Conv1D)           (None, 31, 32)            2080      
_________________________________________________________________
gru_87 (GRU)                 (None, 31, 64)            18816     
_________________________________________________________________
gru_88 (GRU)                 (None, 31, 64)            24960     
_________________________________________________________________
gru_89 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_29 (Dense)             (None, 1)                 65        
=================================================================
Total params: 70,881
Trainable params: 70,881
Non-trainable params: 0
_________________________________________________________________
