Model: "sequential_33"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_32 (Conv1D)           (None, 59, 32)            6176      
_________________________________________________________________
batch_normalization_29 (Batc (None, 59, 32)            128       
_________________________________________________________________
max_pooling1d_29 (MaxPooling (None, 59, 32)            0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 1888)              0         
_________________________________________________________________
dense_31 (Dense)             (None, 64)                120896    
_________________________________________________________________
dropout_22 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_32 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_23 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_33 (Dense)             (None, 1)                 33        
=================================================================
Total params: 129,313
Trainable params: 129,249
Non-trainable params: 64
_________________________________________________________________
