Model: "sequential_41"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 32)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 32)            0         
_________________________________________________________________
conv1d_15 (Conv1D)           (None, 30, 64)            6208      
_________________________________________________________________
gru_18 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_14 (Dense)             (None, 1)                 65        
=================================================================
Total params: 31,233
Trainable params: 31,233
Non-trainable params: 0
_________________________________________________________________
