Model: "sequential_51"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_17 (Conv1D)           (None, 29, 32)            10272     
_________________________________________________________________
bidirectional_22 (Bidirectio (None, 29, 256)           124416    
_________________________________________________________________
bidirectional_23 (Bidirectio (None, 29, 256)           296448    
_________________________________________________________________
bidirectional_24 (Bidirectio (None, 29, 256)           296448    
_________________________________________________________________
bidirectional_25 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_17 (Dense)             (None, 1)                 257       
=================================================================
Total params: 1,024,289
Trainable params: 1,024,289
Non-trainable params: 0
_________________________________________________________________
