Model: "sequential_96"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 16)           0         
_________________________________________________________________
conv1d_102 (Conv1D)          (None, 41, 32)            2592      
_________________________________________________________________
batch_normalization_90 (Batc (None, 41, 32)            128       
_________________________________________________________________
max_pooling1d_90 (MaxPooling (None, 8, 32)             0         
_________________________________________________________________
flatten_26 (Flatten)         (None, 256)               0         
_________________________________________________________________
dense_85 (Dense)             (None, 64)                16448     
_________________________________________________________________
dropout_59 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_86 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_60 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_87 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_61 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_88 (Dense)             (None, 1)                 17        
=================================================================
Total params: 21,793
Trainable params: 21,729
Non-trainable params: 64
_________________________________________________________________
