Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 57, 64)            20544     
_________________________________________________________________
bidirectional_3 (Bidirection (None, 57, 128)           49920     
_________________________________________________________________
bidirectional_4 (Bidirection (None, 128)               74496     
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 145,089
Trainable params: 145,089
Non-trainable params: 0
_________________________________________________________________
