Model: "sequential_78"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_26 (Conv1D)           (None, 57, 32)            10272     
_________________________________________________________________
bidirectional_29 (Bidirectio (None, 57, 64)            12672     
_________________________________________________________________
bidirectional_30 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_26 (Dense)             (None, 1)                 65        
=================================================================
Total params: 41,825
Trainable params: 41,825
Non-trainable params: 0
_________________________________________________________________
