Model: "sequential_36"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 16)           0         
_________________________________________________________________
conv1d_38 (Conv1D)           (None, 62, 32)            1568      
_________________________________________________________________
batch_normalization_33 (Batc (None, 62, 32)            128       
_________________________________________________________________
max_pooling1d_33 (MaxPooling (None, 12, 32)            0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_31 (Dense)             (None, 64)                24640     
_________________________________________________________________
dropout_21 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_32 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_22 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_33 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_23 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_34 (Dense)             (None, 1)                 17        
=================================================================
Total params: 28,961
Trainable params: 28,897
Non-trainable params: 64
_________________________________________________________________
