Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 20, 32)            6176      
_________________________________________________________________
gru_6 (GRU)                  (None, 20, 64)            18816     
_________________________________________________________________
gru_7 (GRU)                  (None, 20, 64)            24960     
_________________________________________________________________
gru_8 (GRU)                  (None, 20, 64)            24960     
_________________________________________________________________
gru_9 (GRU)                  (None, 64)                24960     
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 65        
=================================================================
Total params: 99,937
Trainable params: 99,937
Non-trainable params: 0
_________________________________________________________________
