Model: "sequential_45"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_15 (Conv1D)           (None, 20, 64)            12352     
_________________________________________________________________
gru_45 (GRU)                 (None, 20, 128)           74496     
_________________________________________________________________
gru_46 (GRU)                 (None, 20, 128)           99072     
_________________________________________________________________
gru_47 (GRU)                 (None, 128)               99072     
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 129       
=================================================================
Total params: 285,121
Trainable params: 285,121
Non-trainable params: 0
_________________________________________________________________
