Model: "sequential_69"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_23 (Conv1D)           (None, 19, 64)            20544     
_________________________________________________________________
gru_73 (GRU)                 (None, 19, 32)            9408      
_________________________________________________________________
gru_74 (GRU)                 (None, 19, 32)            6336      
_________________________________________________________________
gru_75 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_23 (Dense)             (None, 1)                 33        
=================================================================
Total params: 42,657
Trainable params: 42,657
Non-trainable params: 0
_________________________________________________________________
