Model: "sequential_72"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_24 (Conv1D)           (None, 20, 64)            12352     
_________________________________________________________________
gru_71 (GRU)                 (None, 20, 64)            24960     
_________________________________________________________________
gru_72 (GRU)                 (None, 20, 64)            24960     
_________________________________________________________________
gru_73 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_24 (Dense)             (None, 1)                 65        
=================================================================
Total params: 87,297
Trainable params: 87,297
Non-trainable params: 0
_________________________________________________________________
