Model: "sequential_33"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 59, 64)            12352     
_________________________________________________________________
bidirectional_13 (Bidirectio (None, 59, 256)           148992    
_________________________________________________________________
bidirectional_14 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_11 (Dense)             (None, 1)                 257       
=================================================================
Total params: 458,049
Trainable params: 458,049
Non-trainable params: 0
_________________________________________________________________
