Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 31, 64)            4160      
_________________________________________________________________
bidirectional_3 (Bidirection (None, 31, 256)           148992    
_________________________________________________________________
bidirectional_4 (Bidirection (None, 31, 256)           296448    
_________________________________________________________________
bidirectional_5 (Bidirection (None, 31, 256)           296448    
_________________________________________________________________
bidirectional_6 (Bidirection (None, 256)               296448    
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 257       
=================================================================
Total params: 1,042,753
Trainable params: 1,042,753
Non-trainable params: 0
_________________________________________________________________
