Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d (Conv1D)              (None, 59, 32)            6176      
_________________________________________________________________
gru (GRU)                    (None, 59, 64)            18816     
_________________________________________________________________
gru_1 (GRU)                  (None, 59, 64)            24960     
_________________________________________________________________
gru_2 (GRU)                  (None, 64)                24960     
_________________________________________________________________
dense (Dense)                (None, 1)                 65        
=================================================================
Total params: 74,977
Trainable params: 74,977
Non-trainable params: 0
_________________________________________________________________
