Model: "sequential_100"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 64)           0         
_________________________________________________________________
conv1d_106 (Conv1D)          (None, 123, 64)           12352     
_________________________________________________________________
batch_normalization_94 (Batc (None, 123, 64)           256       
_________________________________________________________________
max_pooling1d_94 (MaxPooling (None, 123, 64)           0         
_________________________________________________________________
conv1d_107 (Conv1D)          (None, 121, 128)          24704     
_________________________________________________________________
batch_normalization_95 (Batc (None, 121, 128)          512       
_________________________________________________________________
max_pooling1d_95 (MaxPooling (None, 121, 128)          0         
_________________________________________________________________
conv1d_108 (Conv1D)          (None, 119, 256)          98560     
_________________________________________________________________
batch_normalization_96 (Batc (None, 119, 256)          1024      
_________________________________________________________________
max_pooling1d_96 (MaxPooling (None, 119, 256)          0         
_________________________________________________________________
conv1d_109 (Conv1D)          (None, 117, 512)          393728    
_________________________________________________________________
batch_normalization_97 (Batc (None, 117, 512)          2048      
_________________________________________________________________
max_pooling1d_97 (MaxPooling (None, 117, 512)          0         
_________________________________________________________________
flatten_27 (Flatten)         (None, 59904)             0         
_________________________________________________________________
dense_89 (Dense)             (None, 64)                3833920   
_________________________________________________________________
dropout_62 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_90 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_63 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_91 (Dense)             (None, 1)                 33        
=================================================================
Total params: 4,369,217
Trainable params: 4,367,297
Non-trainable params: 1,920
_________________________________________________________________
