Model: "sequential_29"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 15, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 15, 64)            0         
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 4, 64)             20544     
_________________________________________________________________
bidirectional_10 (Bidirectio (None, 256)               148992    
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 257       
=================================================================
Total params: 169,793
Trainable params: 169,793
Non-trainable params: 0
_________________________________________________________________
