Model: "sequential_33"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 59, 64)            12352     
_________________________________________________________________
gru_33 (GRU)                 (None, 59, 64)            24960     
_________________________________________________________________
gru_34 (GRU)                 (None, 59, 64)            24960     
_________________________________________________________________
gru_35 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_11 (Dense)             (None, 1)                 65        
=================================================================
Total params: 87,297
Trainable params: 87,297
Non-trainable params: 0
_________________________________________________________________
