Model: "sequential_62"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 30, 128)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 30, 128)           0         
_________________________________________________________________
conv1d_71 (Conv1D)           (None, 26, 64)            41024     
_________________________________________________________________
batch_normalization_63 (Batc (None, 26, 64)            256       
_________________________________________________________________
max_pooling1d_63 (MaxPooling (None, 26, 64)            0         
_________________________________________________________________
conv1d_72 (Conv1D)           (None, 22, 128)           41088     
_________________________________________________________________
batch_normalization_64 (Batc (None, 22, 128)           512       
_________________________________________________________________
max_pooling1d_64 (MaxPooling (None, 22, 128)           0         
_________________________________________________________________
conv1d_73 (Conv1D)           (None, 18, 256)           164096    
_________________________________________________________________
batch_normalization_65 (Batc (None, 18, 256)           1024      
_________________________________________________________________
max_pooling1d_65 (MaxPooling (None, 18, 256)           0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 4608)              0         
_________________________________________________________________
dense_54 (Dense)             (None, 64)                294976    
_________________________________________________________________
dropout_38 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_55 (Dense)             (None, 1)                 65        
=================================================================
Total params: 543,041
Trainable params: 542,145
Non-trainable params: 896
_________________________________________________________________
