Model: "sequential_86"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 64)           0         
_________________________________________________________________
conv1d_30 (Conv1D)           (None, 41, 32)            10272     
_________________________________________________________________
bidirectional_26 (Bidirectio (None, 41, 64)            12672     
_________________________________________________________________
bidirectional_27 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_29 (Dense)             (None, 1)                 65        
=================================================================
Total params: 41,825
Trainable params: 41,825
Non-trainable params: 0
_________________________________________________________________
