Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 19, 32)            10272     
_________________________________________________________________
bidirectional_4 (Bidirection (None, 19, 256)           124416    
_________________________________________________________________
bidirectional_5 (Bidirection (None, 256)               296448    
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 257       
=================================================================
Total params: 431,393
Trainable params: 431,393
Non-trainable params: 0
_________________________________________________________________
