Model: "sequential_200"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 128)          0         
_________________________________________________________________
conv1d_208 (Conv1D)          (None, 41, 32)            12320     
_________________________________________________________________
batch_normalization_189 (Bat (None, 41, 32)            128       
_________________________________________________________________
max_pooling1d_189 (MaxPoolin (None, 13, 32)            0         
_________________________________________________________________
flatten_55 (Flatten)         (None, 416)               0         
_________________________________________________________________
dense_174 (Dense)            (None, 64)                26688     
_________________________________________________________________
dropout_119 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_175 (Dense)            (None, 1)                 65        
=================================================================
Total params: 39,201
Trainable params: 39,137
Non-trainable params: 64
_________________________________________________________________
