Model: "sequential_88"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 32)           0         
_________________________________________________________________
conv1d_93 (Conv1D)           (None, 61, 32)            5152      
_________________________________________________________________
batch_normalization_83 (Batc (None, 61, 32)            128       
_________________________________________________________________
max_pooling1d_83 (MaxPooling (None, 20, 32)            0         
_________________________________________________________________
flatten_24 (Flatten)         (None, 640)               0         
_________________________________________________________________
dense_78 (Dense)             (None, 64)                41024     
_________________________________________________________________
dropout_54 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_79 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_55 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_80 (Dense)             (None, 1)                 33        
=================================================================
Total params: 48,417
Trainable params: 48,353
Non-trainable params: 64
_________________________________________________________________
