Model: "sequential_181"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 128)          0         
_________________________________________________________________
conv1d_185 (Conv1D)          (None, 41, 64)            24640     
_________________________________________________________________
batch_normalization_168 (Bat (None, 41, 64)            256       
_________________________________________________________________
max_pooling1d_168 (MaxPoolin (None, 41, 64)            0         
_________________________________________________________________
conv1d_186 (Conv1D)          (None, 13, 128)           24704     
_________________________________________________________________
batch_normalization_169 (Bat (None, 13, 128)           512       
_________________________________________________________________
max_pooling1d_169 (MaxPoolin (None, 13, 128)           0         
_________________________________________________________________
conv1d_187 (Conv1D)          (None, 4, 256)            98560     
_________________________________________________________________
batch_normalization_170 (Bat (None, 4, 256)            1024      
_________________________________________________________________
max_pooling1d_170 (MaxPoolin (None, 4, 256)            0         
_________________________________________________________________
conv1d_188 (Conv1D)          (None, 1, 512)            393728    
_________________________________________________________________
batch_normalization_171 (Bat (None, 1, 512)            2048      
_________________________________________________________________
max_pooling1d_171 (MaxPoolin (None, 1, 512)            0         
_________________________________________________________________
flatten_50 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_157 (Dense)            (None, 64)                32832     
_________________________________________________________________
dropout_107 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_158 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_108 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_159 (Dense)            (None, 1)                 33        
=================================================================
Total params: 580,417
Trainable params: 578,497
Non-trainable params: 1,920
_________________________________________________________________
