Model: "sequential_27"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 20, 64)            12352     
_________________________________________________________________
gru_26 (GRU)                 (None, 20, 64)            24960     
_________________________________________________________________
gru_27 (GRU)                 (None, 20, 64)            24960     
_________________________________________________________________
gru_28 (GRU)                 (None, 20, 64)            24960     
_________________________________________________________________
gru_29 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 65        
=================================================================
Total params: 112,257
Trainable params: 112,257
Non-trainable params: 0
_________________________________________________________________
