Model: "sequential_131"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 128)          0         
_________________________________________________________________
conv1d_139 (Conv1D)          (None, 60, 32)            20512     
_________________________________________________________________
batch_normalization_125 (Bat (None, 60, 32)            128       
_________________________________________________________________
max_pooling1d_125 (MaxPoolin (None, 20, 32)            0         
_________________________________________________________________
flatten_36 (Flatten)         (None, 640)               0         
_________________________________________________________________
dense_115 (Dense)            (None, 64)                41024     
_________________________________________________________________
dropout_79 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_116 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_80 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_117 (Dense)            (None, 16)                528       
_________________________________________________________________
dropout_81 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_118 (Dense)            (None, 1)                 17        
=================================================================
Total params: 64,289
Trainable params: 64,225
Non-trainable params: 64
_________________________________________________________________
