Model: "sequential_143"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 128)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 128)           0         
_________________________________________________________________
conv1d_149 (Conv1D)          (None, 58, 64)            41024     
_________________________________________________________________
batch_normalization_134 (Bat (None, 58, 64)            256       
_________________________________________________________________
max_pooling1d_134 (MaxPoolin (None, 58, 64)            0         
_________________________________________________________________
conv1d_150 (Conv1D)          (None, 54, 128)           41088     
_________________________________________________________________
batch_normalization_135 (Bat (None, 54, 128)           512       
_________________________________________________________________
max_pooling1d_135 (MaxPoolin (None, 54, 128)           0         
_________________________________________________________________
flatten_39 (Flatten)         (None, 6912)              0         
_________________________________________________________________
dense_126 (Dense)            (None, 64)                442432    
_________________________________________________________________
dropout_87 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_127 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_88 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_128 (Dense)            (None, 16)                528       
_________________________________________________________________
dropout_89 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_129 (Dense)            (None, 1)                 17        
=================================================================
Total params: 527,937
Trainable params: 527,553
Non-trainable params: 384
_________________________________________________________________
