Model: "sequential_114"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_38 (Conv1D)           (None, 59, 64)            12352     
_________________________________________________________________
bidirectional_48 (Bidirectio (None, 59, 64)            18816     
_________________________________________________________________
bidirectional_49 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_38 (Dense)             (None, 1)                 65        
=================================================================
Total params: 50,049
Trainable params: 50,049
Non-trainable params: 0
_________________________________________________________________
