Model: "sequential_139"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 32)           0         
_________________________________________________________________
conv1d_146 (Conv1D)          (None, 40, 32)            5152      
_________________________________________________________________
batch_normalization_131 (Bat (None, 40, 32)            128       
_________________________________________________________________
max_pooling1d_131 (MaxPoolin (None, 8, 32)             0         
_________________________________________________________________
flatten_38 (Flatten)         (None, 256)               0         
_________________________________________________________________
dense_122 (Dense)            (None, 64)                16448     
_________________________________________________________________
dropout_84 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_123 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_85 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_124 (Dense)            (None, 16)                528       
_________________________________________________________________
dropout_86 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_125 (Dense)            (None, 1)                 17        
=================================================================
Total params: 24,353
Trainable params: 24,289
Non-trainable params: 64
_________________________________________________________________
