Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 29, 32)            10272     
_________________________________________________________________
bidirectional_14 (Bidirectio (None, 29, 64)            12672     
_________________________________________________________________
bidirectional_15 (Bidirectio (None, 29, 64)            18816     
_________________________________________________________________
bidirectional_16 (Bidirectio (None, 29, 64)            18816     
_________________________________________________________________
bidirectional_17 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 65        
=================================================================
Total params: 79,457
Trainable params: 79,457
Non-trainable params: 0
_________________________________________________________________
