Model: "sequential_89"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 128)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 128)           0         
_________________________________________________________________
conv1d_31 (Conv1D)           (None, 20, 32)            20512     
_________________________________________________________________
bidirectional_28 (Bidirectio (None, 20, 64)            16640     
_________________________________________________________________
bidirectional_29 (Bidirectio (None, 64)                24832     
_________________________________________________________________
dense_30 (Dense)             (None, 1)                 65        
=================================================================
Total params: 62,049
Trainable params: 62,049
Non-trainable params: 0
_________________________________________________________________
