Model: "sequential_24"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_11 (Reshape)         (None, 1000, 16)          0         
_________________________________________________________________
bidirectional_6 (Bidirection (None, 1000, 64)          9600      
_________________________________________________________________
bidirectional_7 (Bidirection (None, 1000, 64)          18816     
_________________________________________________________________
bidirectional_8 (Bidirection (None, 1000, 64)          18816     
_________________________________________________________________
bidirectional_9 (Bidirection (None, 64)                18816     
_________________________________________________________________
dense_11 (Dense)             (None, 1)                 65        
=================================================================
Total params: 66,113
Trainable params: 66,113
Non-trainable params: 0
_________________________________________________________________
