Model: "sequential_30"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_29 (Conv1D)           (None, 59, 64)            12352     
_________________________________________________________________
batch_normalization_26 (Batc (None, 59, 64)            256       
_________________________________________________________________
max_pooling1d_26 (MaxPooling (None, 59, 64)            0         
_________________________________________________________________
conv1d_30 (Conv1D)           (None, 57, 128)           24704     
_________________________________________________________________
batch_normalization_27 (Batc (None, 57, 128)           512       
_________________________________________________________________
max_pooling1d_27 (MaxPooling (None, 57, 128)           0         
_________________________________________________________________
conv1d_31 (Conv1D)           (None, 55, 256)           98560     
_________________________________________________________________
batch_normalization_28 (Batc (None, 55, 256)           1024      
_________________________________________________________________
max_pooling1d_28 (MaxPooling (None, 55, 256)           0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 14080)             0         
_________________________________________________________________
dense_29 (Dense)             (None, 64)                901184    
_________________________________________________________________
dropout_21 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_30 (Dense)             (None, 1)                 65        
=================================================================
Total params: 1,038,657
Trainable params: 1,037,761
Non-trainable params: 896
_________________________________________________________________
