Model: "sequential_30"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 57, 64)            20544     
_________________________________________________________________
bidirectional_9 (Bidirection (None, 57, 256)           148992    
_________________________________________________________________
bidirectional_10 (Bidirectio (None, 57, 256)           296448    
_________________________________________________________________
bidirectional_11 (Bidirectio (None, 57, 256)           296448    
_________________________________________________________________
bidirectional_12 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 257       
=================================================================
Total params: 1,059,137
Trainable params: 1,059,137
Non-trainable params: 0
_________________________________________________________________
