Model: "sequential_57"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_19 (Conv1D)           (None, 29, 32)            10272     
_________________________________________________________________
gru_58 (GRU)                 (None, 29, 32)            6336      
_________________________________________________________________
gru_59 (GRU)                 (None, 29, 32)            6336      
_________________________________________________________________
gru_60 (GRU)                 (None, 29, 32)            6336      
_________________________________________________________________
gru_61 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_19 (Dense)             (None, 1)                 33        
=================================================================
Total params: 35,649
Trainable params: 35,649
Non-trainable params: 0
_________________________________________________________________
