Model: "sequential_57"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_64 (Conv1D)           (None, 29, 32)            10272     
_________________________________________________________________
batch_normalization_57 (Batc (None, 29, 32)            128       
_________________________________________________________________
max_pooling1d_57 (MaxPooling (None, 9, 32)             0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 288)               0         
_________________________________________________________________
dense_51 (Dense)             (None, 64)                18496     
_________________________________________________________________
dropout_36 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_52 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_37 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_53 (Dense)             (None, 1)                 33        
=================================================================
Total params: 31,009
Trainable params: 30,945
Non-trainable params: 64
_________________________________________________________________
