Model: "sequential_102"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_34 (Conv1D)           (None, 30, 64)            12352     
_________________________________________________________________
gru_103 (GRU)                (None, 30, 64)            24960     
_________________________________________________________________
gru_104 (GRU)                (None, 64)                24960     
_________________________________________________________________
dense_34 (Dense)             (None, 1)                 65        
=================================================================
Total params: 62,337
Trainable params: 62,337
Non-trainable params: 0
_________________________________________________________________
