Model: "sequential_42"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_14 (Conv1D)           (None, 59, 64)            12352     
_________________________________________________________________
gru_45 (GRU)                 (None, 59, 64)            24960     
_________________________________________________________________
gru_46 (GRU)                 (None, 59, 64)            24960     
_________________________________________________________________
gru_47 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_14 (Dense)             (None, 1)                 65        
=================================================================
Total params: 87,297
Trainable params: 87,297
Non-trainable params: 0
_________________________________________________________________
