Model: "sequential_29"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_13 (Conv1D)           (None, 19, 32)            10272     
_________________________________________________________________
gru_38 (GRU)                 (None, 19, 128)           62208     
_________________________________________________________________
gru_39 (GRU)                 (None, 19, 128)           99072     
_________________________________________________________________
gru_40 (GRU)                 (None, 128)               99072     
_________________________________________________________________
dense_13 (Dense)             (None, 1)                 129       
=================================================================
Total params: 270,753
Trainable params: 270,753
Non-trainable params: 0
_________________________________________________________________
