Model: "sequential_82"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 128)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 128)           0         
_________________________________________________________________
conv1d_88 (Conv1D)           (None, 29, 64)            41024     
_________________________________________________________________
batch_normalization_78 (Batc (None, 29, 64)            256       
_________________________________________________________________
max_pooling1d_78 (MaxPooling (None, 9, 64)             0         
_________________________________________________________________
flatten_22 (Flatten)         (None, 576)               0         
_________________________________________________________________
dense_72 (Dense)             (None, 64)                36928     
_________________________________________________________________
dropout_50 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_73 (Dense)             (None, 1)                 65        
=================================================================
Total params: 78,273
Trainable params: 78,145
Non-trainable params: 128
_________________________________________________________________
