Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 128)          0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 122, 64)           24640     
_________________________________________________________________
gru_6 (GRU)                  (None, 122, 128)          74496     
_________________________________________________________________
gru_7 (GRU)                  (None, 128)               99072     
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 129       
=================================================================
Total params: 198,337
Trainable params: 198,337
Non-trainable params: 0
_________________________________________________________________
