Model: "sequential_62"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_22 (Conv1D)           (None, 59, 32)            6176      
_________________________________________________________________
bidirectional_20 (Bidirectio (None, 59, 256)           124416    
_________________________________________________________________
bidirectional_21 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_21 (Dense)             (None, 1)                 257       
=================================================================
Total params: 427,297
Trainable params: 427,297
Non-trainable params: 0
_________________________________________________________________
