Model: "sequential_41"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 64)            0         
_________________________________________________________________
conv1d_44 (Conv1D)           (None, 30, 32)            6176      
_________________________________________________________________
batch_normalization_38 (Batc (None, 30, 32)            128       
_________________________________________________________________
max_pooling1d_38 (MaxPooling (None, 30, 32)            0         
_________________________________________________________________
conv1d_45 (Conv1D)           (None, 14, 64)            6208      
_________________________________________________________________
batch_normalization_39 (Batc (None, 14, 64)            256       
_________________________________________________________________
max_pooling1d_39 (MaxPooling (None, 14, 64)            0         
_________________________________________________________________
conv1d_46 (Conv1D)           (None, 6, 128)            24704     
_________________________________________________________________
batch_normalization_40 (Batc (None, 6, 128)            512       
_________________________________________________________________
max_pooling1d_40 (MaxPooling (None, 6, 128)            0         
_________________________________________________________________
conv1d_47 (Conv1D)           (None, 2, 256)            98560     
_________________________________________________________________
batch_normalization_41 (Batc (None, 2, 256)            1024      
_________________________________________________________________
max_pooling1d_41 (MaxPooling (None, 2, 256)            0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_35 (Dense)             (None, 64)                32832     
_________________________________________________________________
dropout_24 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_36 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_25 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_37 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_26 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_38 (Dense)             (None, 1)                 17        
=================================================================
Total params: 173,025
Trainable params: 172,065
Non-trainable params: 960
_________________________________________________________________
