Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 31, 32)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 31, 32)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 27, 64)            10304     
_________________________________________________________________
lstm (LSTM)                  (None, 27, 64)            33024     
_________________________________________________________________
lstm_1 (LSTM)                (None, 27, 64)            33024     
_________________________________________________________________
lstm_2 (LSTM)                (None, 64)                33024     
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 65        
=================================================================
Total params: 109,441
Trainable params: 109,441
Non-trainable params: 0
_________________________________________________________________
