Model: "sequential_111"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_37 (Conv1D)           (None, 21, 64)            4160      
_________________________________________________________________
gru_112 (GRU)                (None, 21, 32)            9408      
_________________________________________________________________
gru_113 (GRU)                (None, 21, 32)            6336      
_________________________________________________________________
gru_114 (GRU)                (None, 32)                6336      
_________________________________________________________________
dense_37 (Dense)             (None, 1)                 33        
=================================================================
Total params: 26,273
Trainable params: 26,273
Non-trainable params: 0
_________________________________________________________________
