Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 64)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 122, 32)           6176      
_________________________________________________________________
batch_normalization_2 (Batch (None, 122, 32)           128       
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 40, 32)            0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1280)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                81984     
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 32)                2080      
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 33        
=================================================================
Total params: 90,401
Trainable params: 90,337
Non-trainable params: 64
_________________________________________________________________
