Model: "sequential_23"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_10 (Reshape)         (None, 1000, 16)          0         
_________________________________________________________________
gru_22 (GRU)                 (None, 64)                15744     
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 65        
=================================================================
Total params: 15,809
Trainable params: 15,809
Non-trainable params: 0
_________________________________________________________________
