Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 64)           0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 121, 64)           20544     
_________________________________________________________________
batch_normalization_5 (Batch (None, 121, 64)           256       
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 121, 64)           0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 117, 128)          41088     
_________________________________________________________________
batch_normalization_6 (Batch (None, 117, 128)          512       
_________________________________________________________________
max_pooling1d_6 (MaxPooling1 (None, 117, 128)          0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 14976)             0         
_________________________________________________________________
dense_9 (Dense)              (None, 64)                958528    
_________________________________________________________________
dropout_6 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_10 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_7 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_11 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_8 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 17        
=================================================================
Total params: 1,023,553
Trainable params: 1,023,169
Non-trainable params: 384
_________________________________________________________________
