Model: "sequential_53"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 118, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 118, 32)           0         
_________________________________________________________________
conv1d_19 (Conv1D)           (None, 40, 32)            1056      
_________________________________________________________________
lstm_19 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 33        
=================================================================
Total params: 9,409
Trainable params: 9,409
Non-trainable params: 0
_________________________________________________________________
