Model: "sequential_69"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_55 (Conv1D)           (None, 29, 64)            20544     
_________________________________________________________________
batch_normalization_50 (Batc (None, 29, 64)            256       
_________________________________________________________________
max_pooling1d_50 (MaxPooling (None, 9, 64)             0         
_________________________________________________________________
conv1d_56 (Conv1D)           (None, 3, 128)            41088     
_________________________________________________________________
batch_normalization_51 (Batc (None, 3, 128)            512       
_________________________________________________________________
max_pooling1d_51 (MaxPooling (None, 1, 128)            0         
_________________________________________________________________
flatten_20 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_68 (Dense)             (None, 64)                8256      
_________________________________________________________________
dropout_48 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_69 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_49 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_70 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_50 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_71 (Dense)             (None, 1)                 17        
=================================================================
Total params: 73,281
Trainable params: 72,897
Non-trainable params: 384
_________________________________________________________________
