Model: "sequential_19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_20 (Conv1D)           (None, 57, 64)            20544     
_________________________________________________________________
batch_normalization_17 (Batc (None, 57, 64)            256       
_________________________________________________________________
max_pooling1d_17 (MaxPooling (None, 19, 64)            0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 1216)              0         
_________________________________________________________________
dense_18 (Dense)             (None, 64)                77888     
_________________________________________________________________
dropout_13 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_19 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_14 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_20 (Dense)             (None, 1)                 33        
=================================================================
Total params: 100,801
Trainable params: 100,673
Non-trainable params: 128
_________________________________________________________________
