Model: "sequential_87"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_29 (Conv1D)           (None, 19, 64)            20544     
_________________________________________________________________
bidirectional_35 (Bidirectio (None, 19, 128)           49920     
_________________________________________________________________
bidirectional_36 (Bidirectio (None, 19, 128)           74496     
_________________________________________________________________
bidirectional_37 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_29 (Dense)             (None, 1)                 129       
=================================================================
Total params: 219,585
Trainable params: 219,585
Non-trainable params: 0
_________________________________________________________________
