Model: "sequential_80"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 30, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 30, 64)            0         
_________________________________________________________________
conv1d_28 (Conv1D)           (None, 30, 64)            4160      
_________________________________________________________________
lstm_26 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_27 (Dense)             (None, 1)                 65        
=================================================================
Total params: 37,249
Trainable params: 37,249
Non-trainable params: 0
_________________________________________________________________
