Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 4000, 4)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 1332, 64)          1344      
_________________________________________________________________
gru_3 (GRU)                  (None, 1332, 64)          24960     
_________________________________________________________________
gru_4 (GRU)                  (None, 1332, 64)          24960     
_________________________________________________________________
gru_5 (GRU)                  (None, 1332, 64)          24960     
_________________________________________________________________
gru_6 (GRU)                  (None, 64)                24960     
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
=================================================================
Total params: 101,249
Trainable params: 101,249
Non-trainable params: 0
_________________________________________________________________
