Model: "sequential_68"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 122, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 122, 128)          0         
_________________________________________________________________
conv1d_76 (Conv1D)           (None, 60, 32)            12320     
_________________________________________________________________
batch_normalization_68 (Batc (None, 60, 32)            128       
_________________________________________________________________
max_pooling1d_68 (MaxPooling (None, 20, 32)            0         
_________________________________________________________________
flatten_18 (Flatten)         (None, 640)               0         
_________________________________________________________________
dense_59 (Dense)             (None, 64)                41024     
_________________________________________________________________
dropout_41 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_60 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_42 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_61 (Dense)             (None, 1)                 33        
=================================================================
Total params: 55,585
Trainable params: 55,521
Non-trainable params: 64
_________________________________________________________________
