Model: "sequential_69"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_23 (Conv1D)           (None, 31, 64)            4160      
_________________________________________________________________
gru_69 (GRU)                 (None, 31, 32)            9408      
_________________________________________________________________
gru_70 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_23 (Dense)             (None, 1)                 33        
=================================================================
Total params: 19,937
Trainable params: 19,937
Non-trainable params: 0
_________________________________________________________________
