Model: "sequential_51"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_41 (Conv1D)           (None, 29, 32)            10272     
_________________________________________________________________
batch_normalization_38 (Batc (None, 29, 32)            128       
_________________________________________________________________
max_pooling1d_38 (MaxPooling (None, 5, 32)             0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 160)               0         
_________________________________________________________________
dense_51 (Dense)             (None, 64)                10304     
_________________________________________________________________
dropout_36 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_52 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_37 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_53 (Dense)             (None, 1)                 33        
=================================================================
Total params: 22,817
Trainable params: 22,753
Non-trainable params: 64
_________________________________________________________________
