Model: "sequential_108"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_36 (Conv1D)           (None, 20, 64)            12352     
_________________________________________________________________
gru_111 (GRU)                (None, 20, 64)            24960     
_________________________________________________________________
gru_112 (GRU)                (None, 20, 64)            24960     
_________________________________________________________________
gru_113 (GRU)                (None, 20, 64)            24960     
_________________________________________________________________
gru_114 (GRU)                (None, 64)                24960     
_________________________________________________________________
dense_36 (Dense)             (None, 1)                 65        
=================================================================
Total params: 112,257
Trainable params: 112,257
Non-trainable params: 0
_________________________________________________________________
