Model: "sequential_36"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_12 (Conv1D)           (None, 20, 32)            6176      
_________________________________________________________________
gru_36 (GRU)                 (None, 20, 64)            18816     
_________________________________________________________________
gru_37 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 65        
=================================================================
Total params: 50,017
Trainable params: 50,017
Non-trainable params: 0
_________________________________________________________________
