Model: "sequential_119"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 64)           0         
_________________________________________________________________
conv1d_130 (Conv1D)          (None, 121, 64)           20544     
_________________________________________________________________
batch_normalization_116 (Bat (None, 121, 64)           256       
_________________________________________________________________
max_pooling1d_116 (MaxPoolin (None, 121, 64)           0         
_________________________________________________________________
conv1d_131 (Conv1D)          (None, 117, 128)          41088     
_________________________________________________________________
batch_normalization_117 (Bat (None, 117, 128)          512       
_________________________________________________________________
max_pooling1d_117 (MaxPoolin (None, 117, 128)          0         
_________________________________________________________________
conv1d_132 (Conv1D)          (None, 113, 256)          164096    
_________________________________________________________________
batch_normalization_118 (Bat (None, 113, 256)          1024      
_________________________________________________________________
max_pooling1d_118 (MaxPoolin (None, 113, 256)          0         
_________________________________________________________________
flatten_32 (Flatten)         (None, 28928)             0         
_________________________________________________________________
dense_105 (Dense)            (None, 64)                1851456   
_________________________________________________________________
dropout_73 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_106 (Dense)            (None, 1)                 65        
=================================================================
Total params: 2,079,041
Trainable params: 2,078,145
Non-trainable params: 896
_________________________________________________________________
