Model: "sequential_39"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_35 (Conv1D)           (None, 59, 64)            12352     
_________________________________________________________________
batch_normalization_32 (Batc (None, 59, 64)            256       
_________________________________________________________________
max_pooling1d_32 (MaxPooling (None, 59, 64)            0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 3776)              0         
_________________________________________________________________
dense_38 (Dense)             (None, 64)                241728    
_________________________________________________________________
dropout_27 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_39 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_28 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_40 (Dense)             (None, 1)                 33        
=================================================================
Total params: 256,449
Trainable params: 256,321
Non-trainable params: 128
_________________________________________________________________
