Model: "sequential_115"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 16)           0         
_________________________________________________________________
conv1d_126 (Conv1D)          (None, 41, 64)            5184      
_________________________________________________________________
batch_normalization_113 (Bat (None, 41, 64)            256       
_________________________________________________________________
max_pooling1d_113 (MaxPoolin (None, 41, 64)            0         
_________________________________________________________________
conv1d_127 (Conv1D)          (None, 13, 128)           41088     
_________________________________________________________________
batch_normalization_114 (Bat (None, 13, 128)           512       
_________________________________________________________________
max_pooling1d_114 (MaxPoolin (None, 13, 128)           0         
_________________________________________________________________
flatten_31 (Flatten)         (None, 1664)              0         
_________________________________________________________________
dense_103 (Dense)            (None, 64)                106560    
_________________________________________________________________
dropout_72 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_104 (Dense)            (None, 1)                 65        
=================================================================
Total params: 153,665
Trainable params: 153,281
Non-trainable params: 384
_________________________________________________________________
