Model: "sequential_205"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 32)           0         
_________________________________________________________________
conv1d_214 (Conv1D)          (None, 123, 64)           6208      
_________________________________________________________________
batch_normalization_195 (Bat (None, 123, 64)           256       
_________________________________________________________________
max_pooling1d_195 (MaxPoolin (None, 24, 64)            0         
_________________________________________________________________
flatten_56 (Flatten)         (None, 1536)              0         
_________________________________________________________________
dense_176 (Dense)            (None, 64)                98368     
_________________________________________________________________
dropout_120 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_177 (Dense)            (None, 1)                 65        
=================================================================
Total params: 104,897
Trainable params: 104,769
Non-trainable params: 128
_________________________________________________________________
