Model: "sequential_45"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_15 (Conv1D)           (None, 21, 64)            4160      
_________________________________________________________________
gru_48 (GRU)                 (None, 21, 32)            9408      
_________________________________________________________________
gru_49 (GRU)                 (None, 21, 32)            6336      
_________________________________________________________________
gru_50 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 33        
=================================================================
Total params: 26,273
Trainable params: 26,273
Non-trainable params: 0
_________________________________________________________________
