Model: "sequential_44"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 64)           0         
_________________________________________________________________
conv1d_16 (Conv1D)           (None, 41, 32)            6176      
_________________________________________________________________
gru_19 (GRU)                 (None, 41, 64)            18816     
_________________________________________________________________
gru_20 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 65        
=================================================================
Total params: 50,017
Trainable params: 50,017
Non-trainable params: 0
_________________________________________________________________
