Model: "sequential_120"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_40 (Conv1D)           (None, 57, 32)            10272     
_________________________________________________________________
bidirectional_52 (Bidirectio (None, 57, 256)           124416    
_________________________________________________________________
bidirectional_53 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_40 (Dense)             (None, 1)                 257       
=================================================================
Total params: 431,393
Trainable params: 431,393
Non-trainable params: 0
_________________________________________________________________
