Model: "sequential_48"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_16 (Conv1D)           (None, 20, 64)            12352     
_________________________________________________________________
bidirectional_20 (Bidirectio (None, 20, 128)           49920     
_________________________________________________________________
bidirectional_21 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 129       
=================================================================
Total params: 136,897
Trainable params: 136,897
Non-trainable params: 0
_________________________________________________________________
