Model: "sequential_28"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_15 (Reshape)         (None, 1000, 16)          0         
_________________________________________________________________
bidirectional_16 (Bidirectio (None, 128)               31488     
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 129       
=================================================================
Total params: 31,617
Trainable params: 31,617
Non-trainable params: 0
_________________________________________________________________
