Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 59, 64)            12352     
_________________________________________________________________
batch_normalization_6 (Batch (None, 59, 64)            256       
_________________________________________________________________
max_pooling1d_6 (MaxPooling1 (None, 19, 64)            0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 17, 128)           24704     
_________________________________________________________________
batch_normalization_7 (Batch (None, 17, 128)           512       
_________________________________________________________________
max_pooling1d_7 (MaxPooling1 (None, 5, 128)            0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 3, 256)            98560     
_________________________________________________________________
batch_normalization_8 (Batch (None, 3, 256)            1024      
_________________________________________________________________
max_pooling1d_8 (MaxPooling1 (None, 1, 256)            0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                16448     
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 32)                2080      
_________________________________________________________________
dropout_3 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 16)                528       
_________________________________________________________________
dropout_4 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 17        
=================================================================
Total params: 156,481
Trainable params: 155,585
Non-trainable params: 896
_________________________________________________________________
