Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 32)           0         
_________________________________________________________________
conv1d_19 (Conv1D)           (None, 41, 32)            5152      
_________________________________________________________________
batch_normalization_16 (Batc (None, 41, 32)            128       
_________________________________________________________________
max_pooling1d_16 (MaxPooling (None, 41, 32)            0         
_________________________________________________________________
conv1d_20 (Conv1D)           (None, 13, 64)            10304     
_________________________________________________________________
batch_normalization_17 (Batc (None, 13, 64)            256       
_________________________________________________________________
max_pooling1d_17 (MaxPooling (None, 13, 64)            0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 832)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 64)                53312     
_________________________________________________________________
dropout_10 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_16 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_11 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_17 (Dense)             (None, 1)                 33        
=================================================================
Total params: 71,265
Trainable params: 71,073
Non-trainable params: 192
_________________________________________________________________
