Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 250, 64)           0         
_________________________________________________________________
conv1d (Conv1D)              (None, 82, 32)            10272     
_________________________________________________________________
bidirectional (Bidirectional (None, 256)               124416    
_________________________________________________________________
dense (Dense)                (None, 1)                 257       
=================================================================
Total params: 134,945
Trainable params: 134,945
Non-trainable params: 0
_________________________________________________________________
