Model: "sequential_53"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_21 (Conv1D)           (None, 61, 64)            4160      
_________________________________________________________________
bidirectional_44 (Bidirectio (None, 61, 128)           49920     
_________________________________________________________________
bidirectional_45 (Bidirectio (None, 61, 128)           74496     
_________________________________________________________________
bidirectional_46 (Bidirectio (None, 61, 128)           74496     
_________________________________________________________________
bidirectional_47 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_21 (Dense)             (None, 1)                 129       
=================================================================
Total params: 277,697
Trainable params: 277,697
Non-trainable params: 0
_________________________________________________________________
