Model: "sequential_99"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_33 (Conv1D)           (None, 30, 64)            12352     
_________________________________________________________________
gru_102 (GRU)                (None, 30, 128)           74496     
_________________________________________________________________
gru_103 (GRU)                (None, 30, 128)           99072     
_________________________________________________________________
gru_104 (GRU)                (None, 30, 128)           99072     
_________________________________________________________________
gru_105 (GRU)                (None, 128)               99072     
_________________________________________________________________
dense_33 (Dense)             (None, 1)                 129       
=================================================================
Total params: 384,193
Trainable params: 384,193
Non-trainable params: 0
_________________________________________________________________
