Model: "sequential_105"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 32)           0         
_________________________________________________________________
conv1d_115 (Conv1D)          (None, 41, 64)            6208      
_________________________________________________________________
batch_normalization_103 (Bat (None, 41, 64)            256       
_________________________________________________________________
max_pooling1d_103 (MaxPoolin (None, 13, 64)            0         
_________________________________________________________________
flatten_28 (Flatten)         (None, 832)               0         
_________________________________________________________________
dense_92 (Dense)             (None, 64)                53312     
_________________________________________________________________
dropout_64 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_93 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_65 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_94 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_66 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_95 (Dense)             (None, 1)                 17        
=================================================================
Total params: 62,401
Trainable params: 62,273
Non-trainable params: 128
_________________________________________________________________
