Model: "sequential_128"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 64)            0         
_________________________________________________________________
conv1d_44 (Conv1D)           (None, 20, 64)            20544     
_________________________________________________________________
bidirectional_50 (Bidirectio (None, 20, 128)           49920     
_________________________________________________________________
bidirectional_51 (Bidirectio (None, 20, 128)           74496     
_________________________________________________________________
bidirectional_52 (Bidirectio (None, 20, 128)           74496     
_________________________________________________________________
bidirectional_53 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_43 (Dense)             (None, 1)                 129       
=================================================================
Total params: 294,081
Trainable params: 294,081
Non-trainable params: 0
_________________________________________________________________
