Model: "sequential_59"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 32)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 32)            0         
_________________________________________________________________
conv1d_21 (Conv1D)           (None, 30, 32)            3104      
_________________________________________________________________
lstm_20 (LSTM)               (None, 30, 128)           82432     
_________________________________________________________________
lstm_21 (LSTM)               (None, 30, 128)           131584    
_________________________________________________________________
lstm_22 (LSTM)               (None, 128)               131584    
_________________________________________________________________
dense_20 (Dense)             (None, 1)                 129       
=================================================================
Total params: 348,833
Trainable params: 348,833
Non-trainable params: 0
_________________________________________________________________
