Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 1000, 16)          0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 245, 32)           12320     
_________________________________________________________________
gru_3 (GRU)                  (None, 245, 32)           6336      
_________________________________________________________________
gru_4 (GRU)                  (None, 32)                6336      
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 33        
=================================================================
Total params: 25,025
Trainable params: 25,025
Non-trainable params: 0
_________________________________________________________________
