Model: "sequential_23"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 122, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 122, 32)           0         
_________________________________________________________________
conv1d_24 (Conv1D)           (None, 60, 32)            3104      
_________________________________________________________________
batch_normalization_20 (Batc (None, 60, 32)            128       
_________________________________________________________________
max_pooling1d_20 (MaxPooling (None, 60, 32)            0         
_________________________________________________________________
conv1d_25 (Conv1D)           (None, 29, 64)            6208      
_________________________________________________________________
batch_normalization_21 (Batc (None, 29, 64)            256       
_________________________________________________________________
max_pooling1d_21 (MaxPooling (None, 29, 64)            0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 1856)              0         
_________________________________________________________________
dense_20 (Dense)             (None, 64)                118848    
_________________________________________________________________
dropout_13 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_21 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_14 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_22 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_15 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_23 (Dense)             (None, 1)                 17        
=================================================================
Total params: 131,169
Trainable params: 130,977
Non-trainable params: 192
_________________________________________________________________
