Model: "sequential_51"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_17 (Conv1D)           (None, 57, 32)            10272     
_________________________________________________________________
bidirectional_22 (Bidirectio (None, 57, 128)           37632     
_________________________________________________________________
bidirectional_23 (Bidirectio (None, 57, 128)           74496     
_________________________________________________________________
bidirectional_24 (Bidirectio (None, 57, 128)           74496     
_________________________________________________________________
bidirectional_25 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_17 (Dense)             (None, 1)                 129       
=================================================================
Total params: 271,521
Trainable params: 271,521
Non-trainable params: 0
_________________________________________________________________
