Model: "sequential_33"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 57, 32)            10272     
_________________________________________________________________
gru_37 (GRU)                 (None, 57, 32)            6336      
_________________________________________________________________
gru_38 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_11 (Dense)             (None, 1)                 33        
=================================================================
Total params: 22,977
Trainable params: 22,977
Non-trainable params: 0
_________________________________________________________________
