Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 57, 64)            20544     
_________________________________________________________________
bidirectional_4 (Bidirection (None, 57, 64)            18816     
_________________________________________________________________
bidirectional_5 (Bidirection (None, 64)                18816     
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 65        
=================================================================
Total params: 58,241
Trainable params: 58,241
Non-trainable params: 0
_________________________________________________________________
