Model: "sequential_26"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 64)           0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 61, 64)            20544     
_________________________________________________________________
lstm_10 (LSTM)               (None, 128)               98816     
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 129       
=================================================================
Total params: 119,489
Trainable params: 119,489
Non-trainable params: 0
_________________________________________________________________
