Model: "sequential_78"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_26 (Conv1D)           (None, 31, 64)            4160      
_________________________________________________________________
bidirectional_31 (Bidirectio (None, 31, 64)            18816     
_________________________________________________________________
bidirectional_32 (Bidirectio (None, 31, 64)            18816     
_________________________________________________________________
bidirectional_33 (Bidirectio (None, 31, 64)            18816     
_________________________________________________________________
bidirectional_34 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_26 (Dense)             (None, 1)                 65        
=================================================================
Total params: 79,489
Trainable params: 79,489
Non-trainable params: 0
_________________________________________________________________
