Model: "sequential_42"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_14 (Conv1D)           (None, 31, 64)            4160      
_________________________________________________________________
bidirectional_18 (Bidirectio (None, 31, 64)            18816     
_________________________________________________________________
bidirectional_19 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_14 (Dense)             (None, 1)                 65        
=================================================================
Total params: 41,857
Trainable params: 41,857
Non-trainable params: 0
_________________________________________________________________
