Model: "sequential_48"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_16 (Conv1D)           (None, 57, 64)            20544     
_________________________________________________________________
gru_46 (GRU)                 (None, 57, 64)            24960     
_________________________________________________________________
gru_47 (GRU)                 (None, 57, 64)            24960     
_________________________________________________________________
gru_48 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 65        
=================================================================
Total params: 95,489
Trainable params: 95,489
Non-trainable params: 0
_________________________________________________________________
