Model: "sequential_211"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 32)           0         
_________________________________________________________________
conv1d_224 (Conv1D)          (None, 62, 64)            6208      
_________________________________________________________________
batch_normalization_204 (Bat (None, 62, 64)            256       
_________________________________________________________________
max_pooling1d_204 (MaxPoolin (None, 12, 64)            0         
_________________________________________________________________
flatten_57 (Flatten)         (None, 768)               0         
_________________________________________________________________
dense_178 (Dense)            (None, 64)                49216     
_________________________________________________________________
dropout_121 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_179 (Dense)            (None, 1)                 65        
=================================================================
Total params: 55,745
Trainable params: 55,617
Non-trainable params: 128
_________________________________________________________________
