Model: "sequential_126"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_42 (Conv1D)           (None, 20, 32)            6176      
_________________________________________________________________
bidirectional_54 (Bidirectio (None, 20, 128)           37632     
_________________________________________________________________
bidirectional_55 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_42 (Dense)             (None, 1)                 129       
=================================================================
Total params: 118,433
Trainable params: 118,433
Non-trainable params: 0
_________________________________________________________________
