Model: "sequential_48"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_39 (Conv1D)           (None, 29, 32)            10272     
_________________________________________________________________
batch_normalization_36 (Batc (None, 29, 32)            128       
_________________________________________________________________
max_pooling1d_36 (MaxPooling (None, 29, 32)            0         
_________________________________________________________________
conv1d_40 (Conv1D)           (None, 13, 64)            10304     
_________________________________________________________________
batch_normalization_37 (Batc (None, 13, 64)            256       
_________________________________________________________________
max_pooling1d_37 (MaxPooling (None, 13, 64)            0         
_________________________________________________________________
flatten_14 (Flatten)         (None, 832)               0         
_________________________________________________________________
dense_47 (Dense)             (None, 64)                53312     
_________________________________________________________________
dropout_33 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_48 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_34 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_49 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_35 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_50 (Dense)             (None, 1)                 17        
=================================================================
Total params: 76,897
Trainable params: 76,705
Non-trainable params: 192
_________________________________________________________________
