Model: "sequential_96"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_32 (Conv1D)           (None, 19, 32)            10272     
_________________________________________________________________
gru_96 (GRU)                 (None, 19, 32)            6336      
_________________________________________________________________
gru_97 (GRU)                 (None, 19, 32)            6336      
_________________________________________________________________
gru_98 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_32 (Dense)             (None, 1)                 33        
=================================================================
Total params: 29,313
Trainable params: 29,313
Non-trainable params: 0
_________________________________________________________________
