Model: "sequential_61"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_47 (Conv1D)           (None, 19, 32)            10272     
_________________________________________________________________
batch_normalization_43 (Batc (None, 19, 32)            128       
_________________________________________________________________
max_pooling1d_43 (MaxPooling (None, 19, 32)            0         
_________________________________________________________________
flatten_18 (Flatten)         (None, 608)               0         
_________________________________________________________________
dense_61 (Dense)             (None, 64)                38976     
_________________________________________________________________
dropout_43 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_62 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_44 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_63 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_45 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_64 (Dense)             (None, 1)                 17        
=================================================================
Total params: 52,001
Trainable params: 51,937
Non-trainable params: 64
_________________________________________________________________
