Model: "sequential_194"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 32)           0         
_________________________________________________________________
conv1d_205 (Conv1D)          (None, 40, 64)            10304     
_________________________________________________________________
batch_normalization_186 (Bat (None, 40, 64)            256       
_________________________________________________________________
max_pooling1d_186 (MaxPoolin (None, 40, 64)            0         
_________________________________________________________________
conv1d_206 (Conv1D)          (None, 12, 128)           41088     
_________________________________________________________________
batch_normalization_187 (Bat (None, 12, 128)           512       
_________________________________________________________________
max_pooling1d_187 (MaxPoolin (None, 12, 128)           0         
_________________________________________________________________
flatten_53 (Flatten)         (None, 1536)              0         
_________________________________________________________________
dense_167 (Dense)            (None, 64)                98368     
_________________________________________________________________
dropout_114 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_168 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_115 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_169 (Dense)            (None, 16)                528       
_________________________________________________________________
dropout_116 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_170 (Dense)            (None, 1)                 17        
=================================================================
Total params: 153,153
Trainable params: 152,769
Non-trainable params: 384
_________________________________________________________________
