Model: "sequential_71"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_25 (Conv1D)           (None, 29, 64)            20544     
_________________________________________________________________
gru_33 (GRU)                 (None, 29, 64)            24960     
_________________________________________________________________
gru_34 (GRU)                 (None, 29, 64)            24960     
_________________________________________________________________
gru_35 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_24 (Dense)             (None, 1)                 65        
=================================================================
Total params: 95,489
Trainable params: 95,489
Non-trainable params: 0
_________________________________________________________________
