Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 30, 64)            12352     
_________________________________________________________________
bidirectional_6 (Bidirection (None, 30, 128)           49920     
_________________________________________________________________
bidirectional_7 (Bidirection (None, 30, 128)           74496     
_________________________________________________________________
bidirectional_8 (Bidirection (None, 30, 128)           74496     
_________________________________________________________________
bidirectional_9 (Bidirection (None, 128)               74496     
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 129       
=================================================================
Total params: 285,889
Trainable params: 285,889
Non-trainable params: 0
_________________________________________________________________
