Model: "sequential_53"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 64)           0         
_________________________________________________________________
conv1d_59 (Conv1D)           (None, 41, 32)            6176      
_________________________________________________________________
batch_normalization_53 (Batc (None, 41, 32)            128       
_________________________________________________________________
max_pooling1d_53 (MaxPooling (None, 41, 32)            0         
_________________________________________________________________
conv1d_60 (Conv1D)           (None, 13, 64)            6208      
_________________________________________________________________
batch_normalization_54 (Batc (None, 13, 64)            256       
_________________________________________________________________
max_pooling1d_54 (MaxPooling (None, 13, 64)            0         
_________________________________________________________________
flatten_14 (Flatten)         (None, 832)               0         
_________________________________________________________________
dense_47 (Dense)             (None, 64)                53312     
_________________________________________________________________
dropout_33 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_48 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_34 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_49 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_35 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_50 (Dense)             (None, 1)                 17        
=================================================================
Total params: 68,705
Trainable params: 68,513
Non-trainable params: 192
_________________________________________________________________
