Model: "sequential_171"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 31, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 31, 64)            0         
_________________________________________________________________
conv1d_178 (Conv1D)          (None, 14, 64)            20544     
_________________________________________________________________
batch_normalization_161 (Bat (None, 14, 64)            256       
_________________________________________________________________
max_pooling1d_161 (MaxPoolin (None, 14, 64)            0         
_________________________________________________________________
conv1d_179 (Conv1D)          (None, 5, 128)            41088     
_________________________________________________________________
batch_normalization_162 (Bat (None, 5, 128)            512       
_________________________________________________________________
max_pooling1d_162 (MaxPoolin (None, 5, 128)            0         
_________________________________________________________________
conv1d_180 (Conv1D)          (None, 1, 256)            164096    
_________________________________________________________________
batch_normalization_163 (Bat (None, 1, 256)            1024      
_________________________________________________________________
max_pooling1d_163 (MaxPoolin (None, 1, 256)            0         
_________________________________________________________________
flatten_47 (Flatten)         (None, 256)               0         
_________________________________________________________________
dense_148 (Dense)            (None, 64)                16448     
_________________________________________________________________
dropout_101 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_149 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_102 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_150 (Dense)            (None, 1)                 33        
=================================================================
Total params: 246,081
Trainable params: 245,185
Non-trainable params: 896
_________________________________________________________________
