Model: "sequential_123"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_41 (Conv1D)           (None, 57, 64)            20544     
_________________________________________________________________
bidirectional_54 (Bidirectio (None, 57, 64)            18816     
_________________________________________________________________
bidirectional_55 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_41 (Dense)             (None, 1)                 65        
=================================================================
Total params: 58,241
Trainable params: 58,241
Non-trainable params: 0
_________________________________________________________________
