Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 59, 64)            12352     
_________________________________________________________________
gru_4 (GRU)                  (None, 59, 64)            24960     
_________________________________________________________________
gru_5 (GRU)                  (None, 59, 64)            24960     
_________________________________________________________________
gru_6 (GRU)                  (None, 59, 64)            24960     
_________________________________________________________________
gru_7 (GRU)                  (None, 64)                24960     
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
=================================================================
Total params: 112,257
Trainable params: 112,257
Non-trainable params: 0
_________________________________________________________________
