{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16000], "dtype": "float32", "sparse": false, "ragged": false, "name": "DataPreprocessing_input"}}, {"class_name": "Sequential", "config": {"name": "DataPreprocessing", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16000], "dtype": "float32", "sparse": false, "ragged": false, "name": "spectrogram_input"}}, {"class_name": "Spectrogram", "config": {"name": "spectrogram", "trainable": true, "dtype": "float32", "frame_size": 512, "frame_step": 256, "fft_size": 512}}, {"class_name": "MelSpectrogram", "config": {"name": "mel_spectrogram", "trainable": true, "dtype": "float32", "fft_size": 512, "mel_bins": 64, "sample_rate": 16000, "min_freq": 0, "max_freq": 8000}}, {"class_name": "LogMelSpectrogram", "config": {"name": "log_mel_spectrogram", "trainable": true, "dtype": "float32"}}]}}, {"class_name": "Sequential", "config": {"name": "DataAugmentation", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 61, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "frequency_mask_input"}}, {"class_name": "FrequencyMask", "config": {"name": "frequency_mask", "trainable": true, "dtype": "float32", "max_freq_mask": 10}}, {"class_name": "TimeMask", "config": {"name": "time_mask", "trainable": true, "dtype": "float32", "max_time_mask": 10}}]}}]}}}, "weightsManifest": [{"paths": [], "weights": []}]}