Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 19, 32)            10272     
_________________________________________________________________
bidirectional_19 (Bidirectio (None, 19, 64)            12672     
_________________________________________________________________
bidirectional_20 (Bidirectio (None, 19, 64)            18816     
_________________________________________________________________
bidirectional_21 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 65        
=================================================================
Total params: 60,641
Trainable params: 60,641
Non-trainable params: 0
_________________________________________________________________
