Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 61, 32)            2080      
_________________________________________________________________
bidirectional_5 (Bidirection (None, 61, 128)           37632     
_________________________________________________________________
bidirectional_6 (Bidirection (None, 61, 128)           74496     
_________________________________________________________________
bidirectional_7 (Bidirection (None, 128)               74496     
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 129       
=================================================================
Total params: 188,833
Trainable params: 188,833
Non-trainable params: 0
_________________________________________________________________
