Model: "sequential_99"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_33 (Conv1D)           (None, 57, 32)            10272     
_________________________________________________________________
bidirectional_41 (Bidirectio (None, 57, 256)           124416    
_________________________________________________________________
bidirectional_42 (Bidirectio (None, 57, 256)           296448    
_________________________________________________________________
bidirectional_43 (Bidirectio (None, 57, 256)           296448    
_________________________________________________________________
bidirectional_44 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_33 (Dense)             (None, 1)                 257       
=================================================================
Total params: 1,024,289
Trainable params: 1,024,289
Non-trainable params: 0
_________________________________________________________________
