Model: "sequential_93"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_31 (Conv1D)           (None, 29, 32)            10272     
_________________________________________________________________
bidirectional_38 (Bidirectio (None, 29, 256)           124416    
_________________________________________________________________
bidirectional_39 (Bidirectio (None, 29, 256)           296448    
_________________________________________________________________
bidirectional_40 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_31 (Dense)             (None, 1)                 257       
=================================================================
Total params: 727,841
Trainable params: 727,841
Non-trainable params: 0
_________________________________________________________________
