Model: "sequential_128"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 32)           0         
_________________________________________________________________
conv1d_135 (Conv1D)          (None, 121, 32)           5152      
_________________________________________________________________
batch_normalization_121 (Bat (None, 121, 32)           128       
_________________________________________________________________
max_pooling1d_121 (MaxPoolin (None, 121, 32)           0         
_________________________________________________________________
conv1d_136 (Conv1D)          (None, 117, 64)           10304     
_________________________________________________________________
batch_normalization_122 (Bat (None, 117, 64)           256       
_________________________________________________________________
max_pooling1d_122 (MaxPoolin (None, 117, 64)           0         
_________________________________________________________________
conv1d_137 (Conv1D)          (None, 113, 128)          41088     
_________________________________________________________________
batch_normalization_123 (Bat (None, 113, 128)          512       
_________________________________________________________________
max_pooling1d_123 (MaxPoolin (None, 113, 128)          0         
_________________________________________________________________
conv1d_138 (Conv1D)          (None, 109, 256)          164096    
_________________________________________________________________
batch_normalization_124 (Bat (None, 109, 256)          1024      
_________________________________________________________________
max_pooling1d_124 (MaxPoolin (None, 109, 256)          0         
_________________________________________________________________
flatten_35 (Flatten)         (None, 27904)             0         
_________________________________________________________________
dense_112 (Dense)            (None, 64)                1785920   
_________________________________________________________________
dropout_77 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_113 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_78 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_114 (Dense)            (None, 1)                 33        
=================================================================
Total params: 2,010,593
Trainable params: 2,009,633
Non-trainable params: 960
_________________________________________________________________
