Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 128)          0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 41, 64)            24640     
_________________________________________________________________
lstm_7 (LSTM)                (None, 41, 128)           98816     
_________________________________________________________________
lstm_8 (LSTM)                (None, 41, 128)           131584    
_________________________________________________________________
lstm_9 (LSTM)                (None, 128)               131584    
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 129       
=================================================================
Total params: 386,753
Trainable params: 386,753
Non-trainable params: 0
_________________________________________________________________
