Model: "sequential_50"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_20 (Conv1D)           (None, 19, 64)            20544     
_________________________________________________________________
bidirectional_40 (Bidirectio (None, 19, 128)           49920     
_________________________________________________________________
bidirectional_41 (Bidirectio (None, 19, 128)           74496     
_________________________________________________________________
bidirectional_42 (Bidirectio (None, 19, 128)           74496     
_________________________________________________________________
bidirectional_43 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_20 (Dense)             (None, 1)                 129       
=================================================================
Total params: 294,081
Trainable params: 294,081
Non-trainable params: 0
_________________________________________________________________
