Model: "sequential_168"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 32)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 32)            0         
_________________________________________________________________
conv1d_176 (Conv1D)          (None, 60, 32)            3104      
_________________________________________________________________
batch_normalization_159 (Bat (None, 60, 32)            128       
_________________________________________________________________
max_pooling1d_159 (MaxPoolin (None, 12, 32)            0         
_________________________________________________________________
conv1d_177 (Conv1D)          (None, 10, 64)            6208      
_________________________________________________________________
batch_normalization_160 (Bat (None, 10, 64)            256       
_________________________________________________________________
max_pooling1d_160 (MaxPoolin (None, 2, 64)             0         
_________________________________________________________________
flatten_46 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_146 (Dense)            (None, 64)                8256      
_________________________________________________________________
dropout_100 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_147 (Dense)            (None, 1)                 65        
=================================================================
Total params: 18,017
Trainable params: 17,825
Non-trainable params: 192
_________________________________________________________________
