Model: "sequential_129"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_43 (Conv1D)           (None, 20, 32)            6176      
_________________________________________________________________
bidirectional_56 (Bidirectio (None, 20, 64)            12672     
_________________________________________________________________
bidirectional_57 (Bidirectio (None, 20, 64)            18816     
_________________________________________________________________
bidirectional_58 (Bidirectio (None, 20, 64)            18816     
_________________________________________________________________
bidirectional_59 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_43 (Dense)             (None, 1)                 65        
=================================================================
Total params: 75,361
Trainable params: 75,361
Non-trainable params: 0
_________________________________________________________________
