Model: "sequential_21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 19, 32)            10272     
_________________________________________________________________
gru_22 (GRU)                 (None, 19, 32)            6336      
_________________________________________________________________
gru_23 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 33        
=================================================================
Total params: 22,977
Trainable params: 22,977
Non-trainable params: 0
_________________________________________________________________
