Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 61, 32)            2080      
_________________________________________________________________
gru_20 (GRU)                 (None, 61, 128)           62208     
_________________________________________________________________
gru_21 (GRU)                 (None, 128)               99072     
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 129       
=================================================================
Total params: 163,489
Trainable params: 163,489
Non-trainable params: 0
_________________________________________________________________
