{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"conv1d_201_input:0": {"name": "conv1d_201_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "61"}, {"size": "64"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_194/conv1d_201/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_201/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/batch_normalization_178/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/batch_normalization_178/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/max_pooling1d_178/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_202/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_202/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/batch_normalization_179/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/batch_normalization_179/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/max_pooling1d_179/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_194/flatten_48/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1d_201_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "61"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_201/conv1d/ExpandDims", "op": "ExpandDims", "input": ["conv1d_201_input", "StatefulPartitionedCall/sequential_194/conv1d_201/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_201/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_194/conv1d_201/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_194/conv1d_201/conv1d/ExpandDims_1", "unknown_0"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_201/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_194/conv1d_201/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_201/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_194/conv1d_201/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/batch_normalization_178/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_194/conv1d_201/Relu", "StatefulPartitionedCall/sequential_194/batch_normalization_178/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/batch_normalization_178/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_194/batch_normalization_178/batchnorm/mul_1", "StatefulPartitionedCall/sequential_194/batch_normalization_178/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/max_pooling1d_178/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_194/batch_normalization_178/batchnorm/add_1", "StatefulPartitionedCall/sequential_194/max_pooling1d_178/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/max_pooling1d_178/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_194/max_pooling1d_178/ExpandDims"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "3", "1", "1"]}}, "ksize": {"list": {"i": ["1", "3", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_194/max_pooling1d_178/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_194/max_pooling1d_178/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_202/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_194/max_pooling1d_178/Squeeze", "StatefulPartitionedCall/sequential_194/conv1d_202/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_202/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_194/conv1d_202/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_194/conv1d_202/conv1d/ExpandDims_1", "unknown_6"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_202/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_194/conv1d_202/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_202/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_194/conv1d_202/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/batch_normalization_179/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_194/conv1d_202/Relu", "StatefulPartitionedCall/sequential_194/batch_normalization_179/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/batch_normalization_179/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_194/batch_normalization_179/batchnorm/mul_1", "StatefulPartitionedCall/sequential_194/batch_normalization_179/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/max_pooling1d_179/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_194/batch_normalization_179/batchnorm/add_1", "StatefulPartitionedCall/sequential_194/max_pooling1d_179/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_194/max_pooling1d_179/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_194/max_pooling1d_179/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "3", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "3", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_194/max_pooling1d_179/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_194/max_pooling1d_179/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_194/flatten_48/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_194/max_pooling1d_179/Squeeze", "StatefulPartitionedCall/sequential_194/flatten_48/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_194/dense_149/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_194/flatten_48/Reshape", "unknown_11", "unknown_12"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_194/dense_150/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_194/dense_149/Relu", "unknown_13", "unknown_14"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_194/dense_150/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_194/dense_150/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_194/dense_150/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_194/conv1d_201/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_201/conv1d/ExpandDims_1", "shape": [1, 5, 64, 64], "dtype": "float32"}, {"name": "unknown_0", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_194/batch_normalization_178/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_194/batch_normalization_178/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_194/max_pooling1d_178/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_202/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_194/conv1d_202/conv1d/ExpandDims_1", "shape": [1, 5, 64, 128], "dtype": "float32"}, {"name": "unknown_6", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_194/batch_normalization_179/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_194/batch_normalization_179/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_194/max_pooling1d_179/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_194/flatten_48/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_11", "shape": [640, 64], "dtype": "float32"}, {"name": "unknown_12", "shape": [64], "dtype": "float32"}, {"name": "unknown_13", "shape": [64, 1], "dtype": "float32"}, {"name": "unknown_14", "shape": [1], "dtype": "float32"}]}]}