Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 16)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 16)            0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 20, 32)            1568      
_________________________________________________________________
bidirectional_6 (Bidirection (None, 20, 128)           37632     
_________________________________________________________________
bidirectional_7 (Bidirection (None, 20, 128)           74496     
_________________________________________________________________
bidirectional_8 (Bidirection (None, 128)               74496     
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 129       
=================================================================
Total params: 188,321
Trainable params: 188,321
Non-trainable params: 0
_________________________________________________________________
