Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_5 (Reshape)          (None, 2000, 8)           0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 659, 64)           12352     
_________________________________________________________________
bidirectional_6 (Bidirection (None, 256)               148992    
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 257       
=================================================================
Total params: 161,601
Trainable params: 161,601
Non-trainable params: 0
_________________________________________________________________
