{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"datapreprocessing_input:0": {"name": "datapreprocessing_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16000"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "61"}, {"size": "64"}]}}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "257"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/zeros_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/floordiv_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_1/values_1/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/range_1/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/range_1/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_2/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Maximum/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame_step", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame_length", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/packed", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/hann_window/sub_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/rfft/fft_length", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/log_mel_spectrogram/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "datapreprocessing_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "16000"}]}}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Shape", "op": "Shape", "input": ["datapreprocessing_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/split", "op": "SplitV", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Shape", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/packed", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/split/split_dim"], "attr": {"T": {"type": "DT_INT32"}, "Tlen": {"type": "DT_INT32"}, "num_split": {"i": "3"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape", "op": "Reshape", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/split:1", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/floordiv_3", "op": "FloorDiv", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/floordiv_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/sub_2", "op": "Sub", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame_length"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/mul", "op": "Mul", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/floordiv_3", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_1/values_1", "op": "Pack", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/floordiv_3", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_1/values_1/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/floordiv", "op": "FloorDiv", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/sub_2", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame_step"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat/values_1_const_axis", "op": "Const", "input": ["^PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/mul"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_1", "op": "ConcatV2", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/split", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_1/values_1", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/split:2", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_1/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/add", "op": "AddV2", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/add/x", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat/values_1", "op": "ExpandDims", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/mul", "ConstantFolding/PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat/values_1_const_axis"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Maximum", "op": "Maximum", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Maximum/x", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/add"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat", "op": "ConcatV2", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/split", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat/values_1", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/split:2", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/range_1", "op": "Range", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/range_1/start", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Maximum", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/range_1/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_2/shape", "op": "Pack", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Maximum", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_2/shape/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_2/values_1", "op": "Pack", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Maximum", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame_length"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/StridedSlice", "op": "StridedSlice", "input": ["datapreprocessing_input", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/zeros_like", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/ones_like"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_2", "op": "Reshape", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/range_1", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_2", "op": "ConcatV2", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/split", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_2/values_1", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/split:2", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_2/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/StridedSlice", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/add_1", "op": "AddV2", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_2", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_3"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/GatherV2", "op": "GatherV2", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_1", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/add_1", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/strided_slice"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_4", "op": "Reshape", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/GatherV2", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_2"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/mul", "op": "Mul", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_4", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/hann_window/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/rfft", "op": "RFFT", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/mul", "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/rfft/fft_length"], "attr": {"Treal": {"type": "DT_FLOAT"}, "Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/Abs", "op": "ComplexAbs", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/rfft"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Shape", "op": "Shape", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/Abs"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Shape", "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/axes", "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/GatherV2", "op": "GatherV2", "input": ["PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Shape", "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/free", "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Prod_1", "op": "Prod", "input": ["PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/GatherV2_1", "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Prod", "op": "Prod", "input": ["PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/GatherV2", "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/concat_1", "op": "ConcatV2", "input": ["PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/GatherV2", "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Const_2", "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/stack", "op": "Pack", "input": ["PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Prod", "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Reshape", "op": "Reshape", "input": ["PartitionedCall/sequential_1/DataPreprocessing/spectrogram/Abs", "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/MatMul", "op": "MatMul", "input": ["PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Reshape", "unknown"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot", "op": "Reshape", "input": ["PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/MatMul", "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/log_mel_spectrogram/add", "op": "AddV2", "input": ["PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot", "PartitionedCall/sequential_1/DataPreprocessing/log_mel_spectrogram/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/log_mel_spectrogram/Log", "op": "Log", "input": ["PartitionedCall/sequential_1/DataPreprocessing/log_mel_spectrogram/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/sequential_1/DataPreprocessing/log_mel_spectrogram/Log"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "unknown", "shape": [257, 64], "dtype": "float32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/zeros_like", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/mul/y", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/ones_like", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/floordiv_3/y", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_1/values_1/1", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/range_1/start", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/range_1/delta", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_2/shape/1", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape_3", "shape": [1, 2], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/strided_slice", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Maximum/x", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/add/x", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/Reshape/shape", "shape": [0], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame_step", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame_length", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/packed", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat_2/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/hann_window/sub_2", "shape": [512], "dtype": "float32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/rfft/fft_length", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/mel_spectrogram/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/sequential_1/DataPreprocessing/log_mel_spectrogram/add/y", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/PartitionedCall/sequential_1/DataPreprocessing/spectrogram/stft/frame/concat/values_1_const_axis", "shape": [], "dtype": "int32"}]}]}