Model: "sequential_24"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 19, 64)            20544     
_________________________________________________________________
bidirectional_7 (Bidirection (None, 19, 256)           148992    
_________________________________________________________________
bidirectional_8 (Bidirection (None, 256)               296448    
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 257       
=================================================================
Total params: 466,241
Trainable params: 466,241
Non-trainable params: 0
_________________________________________________________________
