Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d (Conv1D)              (None, 57, 64)            20544     
_________________________________________________________________
bidirectional (Bidirectional (None, 57, 256)           148992    
_________________________________________________________________
bidirectional_1 (Bidirection (None, 57, 256)           296448    
_________________________________________________________________
bidirectional_2 (Bidirection (None, 256)               296448    
_________________________________________________________________
dense (Dense)                (None, 1)                 257       
=================================================================
Total params: 762,689
Trainable params: 762,689
Non-trainable params: 0
_________________________________________________________________
