Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 1600, 10)          0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 399, 32)           1632      
_________________________________________________________________
gru_1 (GRU)                  (None, 399, 32)           6336      
_________________________________________________________________
gru_2 (GRU)                  (None, 399, 32)           6336      
_________________________________________________________________
gru_3 (GRU)                  (None, 32)                6336      
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 33        
=================================================================
Total params: 20,673
Trainable params: 20,673
Non-trainable params: 0
_________________________________________________________________
