Model: "sequential_23"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_23 (Conv1D)           (None, 29, 64)            20544     
_________________________________________________________________
batch_normalization_20 (Batc (None, 29, 64)            256       
_________________________________________________________________
max_pooling1d_20 (MaxPooling (None, 29, 64)            0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 1856)              0         
_________________________________________________________________
dense_21 (Dense)             (None, 64)                118848    
_________________________________________________________________
dropout_15 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_22 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_16 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_23 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_17 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_24 (Dense)             (None, 1)                 17        
=================================================================
Total params: 142,273
Trainable params: 142,145
Non-trainable params: 128
_________________________________________________________________
