Model: "sequential_91"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 16)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 16)            0         
_________________________________________________________________
conv1d_94 (Conv1D)           (None, 59, 64)            3136      
_________________________________________________________________
batch_normalization_84 (Batc (None, 59, 64)            256       
_________________________________________________________________
max_pooling1d_84 (MaxPooling (None, 19, 64)            0         
_________________________________________________________________
conv1d_95 (Conv1D)           (None, 17, 128)           24704     
_________________________________________________________________
batch_normalization_85 (Batc (None, 17, 128)           512       
_________________________________________________________________
max_pooling1d_85 (MaxPooling (None, 5, 128)            0         
_________________________________________________________________
flatten_25 (Flatten)         (None, 640)               0         
_________________________________________________________________
dense_81 (Dense)             (None, 64)                41024     
_________________________________________________________________
dropout_56 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_82 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_57 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_83 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_58 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_84 (Dense)             (None, 1)                 17        
=================================================================
Total params: 72,257
Trainable params: 71,873
Non-trainable params: 384
_________________________________________________________________
