Model: "sequential_223"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 128)          0         
_________________________________________________________________
conv1d_237 (Conv1D)          (None, 41, 64)            24640     
_________________________________________________________________
batch_normalization_216 (Bat (None, 41, 64)            256       
_________________________________________________________________
max_pooling1d_216 (MaxPoolin (None, 41, 64)            0         
_________________________________________________________________
conv1d_238 (Conv1D)          (None, 13, 128)           24704     
_________________________________________________________________
batch_normalization_217 (Bat (None, 13, 128)           512       
_________________________________________________________________
max_pooling1d_217 (MaxPoolin (None, 13, 128)           0         
_________________________________________________________________
conv1d_239 (Conv1D)          (None, 4, 256)            98560     
_________________________________________________________________
batch_normalization_218 (Bat (None, 4, 256)            1024      
_________________________________________________________________
max_pooling1d_218 (MaxPoolin (None, 4, 256)            0         
_________________________________________________________________
conv1d_240 (Conv1D)          (None, 1, 512)            393728    
_________________________________________________________________
batch_normalization_219 (Bat (None, 1, 512)            2048      
_________________________________________________________________
max_pooling1d_219 (MaxPoolin (None, 1, 512)            0         
_________________________________________________________________
flatten_60 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_186 (Dense)            (None, 64)                32832     
_________________________________________________________________
dropout_126 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_187 (Dense)            (None, 1)                 65        
=================================================================
Total params: 578,369
Trainable params: 576,449
Non-trainable params: 1,920
_________________________________________________________________
