Model: "sequential_126"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_42 (Conv1D)           (None, 19, 32)            10272     
_________________________________________________________________
bidirectional_56 (Bidirectio (None, 19, 128)           37632     
_________________________________________________________________
bidirectional_57 (Bidirectio (None, 19, 128)           74496     
_________________________________________________________________
bidirectional_58 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_42 (Dense)             (None, 1)                 129       
=================================================================
Total params: 197,025
Trainable params: 197,025
Non-trainable params: 0
_________________________________________________________________
