Model: "sequential_177"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 64)           0         
_________________________________________________________________
conv1d_182 (Conv1D)          (None, 122, 64)           12352     
_________________________________________________________________
batch_normalization_165 (Bat (None, 122, 64)           256       
_________________________________________________________________
max_pooling1d_165 (MaxPoolin (None, 122, 64)           0         
_________________________________________________________________
flatten_49 (Flatten)         (None, 7808)              0         
_________________________________________________________________
dense_154 (Dense)            (None, 64)                499776    
_________________________________________________________________
dropout_105 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_155 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_106 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_156 (Dense)            (None, 1)                 33        
=================================================================
Total params: 514,497
Trainable params: 514,369
Non-trainable params: 128
_________________________________________________________________
