Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_2 (Reshape)          (None, 500, 32)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 166, 32)           5152      
_________________________________________________________________
bidirectional (Bidirectional (None, 166, 256)          124416    
_________________________________________________________________
bidirectional_1 (Bidirection (None, 256)               296448    
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 426,273
Trainable params: 426,273
Non-trainable params: 0
_________________________________________________________________
