Model: "sequential_44"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_48 (Conv1D)           (None, 30, 32)            6176      
_________________________________________________________________
batch_normalization_42 (Batc (None, 30, 32)            128       
_________________________________________________________________
max_pooling1d_42 (MaxPooling (None, 30, 32)            0         
_________________________________________________________________
conv1d_49 (Conv1D)           (None, 14, 64)            6208      
_________________________________________________________________
batch_normalization_43 (Batc (None, 14, 64)            256       
_________________________________________________________________
max_pooling1d_43 (MaxPooling (None, 14, 64)            0         
_________________________________________________________________
conv1d_50 (Conv1D)           (None, 6, 128)            24704     
_________________________________________________________________
batch_normalization_44 (Batc (None, 6, 128)            512       
_________________________________________________________________
max_pooling1d_44 (MaxPooling (None, 6, 128)            0         
_________________________________________________________________
conv1d_51 (Conv1D)           (None, 2, 256)            98560     
_________________________________________________________________
batch_normalization_45 (Batc (None, 2, 256)            1024      
_________________________________________________________________
max_pooling1d_45 (MaxPooling (None, 2, 256)            0         
_________________________________________________________________
flatten_12 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_39 (Dense)             (None, 64)                32832     
_________________________________________________________________
dropout_27 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_40 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_28 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_41 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_29 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_42 (Dense)             (None, 1)                 17        
=================================================================
Total params: 173,025
Trainable params: 172,065
Non-trainable params: 960
_________________________________________________________________
