Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 31, 64)            4160      
_________________________________________________________________
bidirectional_2 (Bidirection (None, 31, 256)           148992    
_________________________________________________________________
bidirectional_3 (Bidirection (None, 256)               296448    
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 449,857
Trainable params: 449,857
Non-trainable params: 0
_________________________________________________________________
