Model: "sequential_30"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 19, 64)            20544     
_________________________________________________________________
gru_33 (GRU)                 (None, 19, 64)            24960     
_________________________________________________________________
gru_34 (GRU)                 (None, 19, 64)            24960     
_________________________________________________________________
gru_35 (GRU)                 (None, 19, 64)            24960     
_________________________________________________________________
gru_36 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 65        
=================================================================
Total params: 120,449
Trainable params: 120,449
Non-trainable params: 0
_________________________________________________________________
