Model: "sequential_63"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_21 (Conv1D)           (None, 21, 32)            2080      
_________________________________________________________________
bidirectional_26 (Bidirectio (None, 21, 256)           124416    
_________________________________________________________________
bidirectional_27 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_21 (Dense)             (None, 1)                 257       
=================================================================
Total params: 423,201
Trainable params: 423,201
Non-trainable params: 0
_________________________________________________________________
