Model: "sequential_162"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 16)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 16)            0         
_________________________________________________________________
conv1d_172 (Conv1D)          (None, 58, 32)            2592      
_________________________________________________________________
batch_normalization_155 (Bat (None, 58, 32)            128       
_________________________________________________________________
max_pooling1d_155 (MaxPoolin (None, 11, 32)            0         
_________________________________________________________________
conv1d_173 (Conv1D)          (None, 7, 64)             10304     
_________________________________________________________________
batch_normalization_156 (Bat (None, 7, 64)             256       
_________________________________________________________________
max_pooling1d_156 (MaxPoolin (None, 1, 64)             0         
_________________________________________________________________
flatten_44 (Flatten)         (None, 64)                0         
_________________________________________________________________
dense_140 (Dense)            (None, 64)                4160      
_________________________________________________________________
dropout_96 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_141 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_97 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_142 (Dense)            (None, 1)                 33        
=================================================================
Total params: 19,553
Trainable params: 19,361
Non-trainable params: 192
_________________________________________________________________
