Model: "sequential_23"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 19, 64)            20544     
_________________________________________________________________
bidirectional_22 (Bidirectio (None, 19, 256)           148992    
_________________________________________________________________
bidirectional_23 (Bidirectio (None, 19, 256)           296448    
_________________________________________________________________
bidirectional_24 (Bidirectio (None, 19, 256)           296448    
_________________________________________________________________
bidirectional_25 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_11 (Dense)             (None, 1)                 257       
=================================================================
Total params: 1,059,137
Trainable params: 1,059,137
Non-trainable params: 0
_________________________________________________________________
