Model: "sequential_154"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 122, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 122, 128)          0         
_________________________________________________________________
conv1d_162 (Conv1D)          (None, 40, 64)            24640     
_________________________________________________________________
batch_normalization_146 (Bat (None, 40, 64)            256       
_________________________________________________________________
max_pooling1d_146 (MaxPoolin (None, 40, 64)            0         
_________________________________________________________________
flatten_42 (Flatten)         (None, 2560)              0         
_________________________________________________________________
dense_135 (Dense)            (None, 64)                163904    
_________________________________________________________________
dropout_93 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_136 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_94 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_137 (Dense)            (None, 1)                 33        
=================================================================
Total params: 190,913
Trainable params: 190,785
Non-trainable params: 128
_________________________________________________________________
