Model: "sequential_134"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 32)           0         
_________________________________________________________________
conv1d_140 (Conv1D)          (None, 62, 32)            3104      
_________________________________________________________________
batch_normalization_126 (Bat (None, 62, 32)            128       
_________________________________________________________________
max_pooling1d_126 (MaxPoolin (None, 12, 32)            0         
_________________________________________________________________
flatten_37 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_119 (Dense)            (None, 64)                24640     
_________________________________________________________________
dropout_82 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_120 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_83 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_121 (Dense)            (None, 1)                 33        
=================================================================
Total params: 29,985
Trainable params: 29,921
Non-trainable params: 64
_________________________________________________________________
