Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 59, 64)            12352     
_________________________________________________________________
bidirectional_2 (Bidirection (None, 59, 64)            18816     
_________________________________________________________________
bidirectional_3 (Bidirection (None, 59, 64)            18816     
_________________________________________________________________
bidirectional_4 (Bidirection (None, 64)                18816     
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 65        
=================================================================
Total params: 68,865
Trainable params: 68,865
Non-trainable params: 0
_________________________________________________________________
