Model: "sequential_72"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_24 (Conv1D)           (None, 31, 64)            4160      
_________________________________________________________________
bidirectional_26 (Bidirectio (None, 31, 256)           148992    
_________________________________________________________________
bidirectional_27 (Bidirectio (None, 31, 256)           296448    
_________________________________________________________________
bidirectional_28 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_24 (Dense)             (None, 1)                 257       
=================================================================
Total params: 746,305
Trainable params: 746,305
Non-trainable params: 0
_________________________________________________________________
