Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 1000, 16)          0         
_________________________________________________________________
conv1d (Conv1D)              (None, 245, 32)           12320     
_________________________________________________________________
gru (GRU)                    (None, 245, 128)          62208     
_________________________________________________________________
gru_1 (GRU)                  (None, 245, 128)          99072     
_________________________________________________________________
gru_2 (GRU)                  (None, 245, 128)          99072     
_________________________________________________________________
gru_3 (GRU)                  (None, 128)               99072     
_________________________________________________________________
dense (Dense)                (None, 1)                 129       
=================================================================
Total params: 371,873
Trainable params: 371,873
Non-trainable params: 0
_________________________________________________________________
