Model: "sequential_45"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_38 (Conv1D)           (None, 19, 32)            10272     
_________________________________________________________________
batch_normalization_35 (Batc (None, 19, 32)            128       
_________________________________________________________________
max_pooling1d_35 (MaxPooling (None, 19, 32)            0         
_________________________________________________________________
flatten_13 (Flatten)         (None, 608)               0         
_________________________________________________________________
dense_44 (Dense)             (None, 64)                38976     
_________________________________________________________________
dropout_31 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_45 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_32 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_46 (Dense)             (None, 1)                 33        
=================================================================
Total params: 51,489
Trainable params: 51,425
Non-trainable params: 64
_________________________________________________________________
