Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 29, 64)            20544     
_________________________________________________________________
bidirectional_10 (Bidirectio (None, 29, 64)            18816     
_________________________________________________________________
bidirectional_11 (Bidirectio (None, 29, 64)            18816     
_________________________________________________________________
bidirectional_12 (Bidirectio (None, 29, 64)            18816     
_________________________________________________________________
bidirectional_13 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 65        
=================================================================
Total params: 95,873
Trainable params: 95,873
Non-trainable params: 0
_________________________________________________________________
