Model: "sequential_214"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 122, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 122, 128)          0         
_________________________________________________________________
conv1d_225 (Conv1D)          (None, 40, 32)            12320     
_________________________________________________________________
batch_normalization_205 (Bat (None, 40, 32)            128       
_________________________________________________________________
max_pooling1d_205 (MaxPoolin (None, 40, 32)            0         
_________________________________________________________________
conv1d_226 (Conv1D)          (None, 13, 64)            6208      
_________________________________________________________________
batch_normalization_206 (Bat (None, 13, 64)            256       
_________________________________________________________________
max_pooling1d_206 (MaxPoolin (None, 13, 64)            0         
_________________________________________________________________
conv1d_227 (Conv1D)          (None, 4, 128)            24704     
_________________________________________________________________
batch_normalization_207 (Bat (None, 4, 128)            512       
_________________________________________________________________
max_pooling1d_207 (MaxPoolin (None, 4, 128)            0         
_________________________________________________________________
flatten_58 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_180 (Dense)            (None, 64)                32832     
_________________________________________________________________
dropout_122 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_181 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_123 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_182 (Dense)            (None, 16)                528       
_________________________________________________________________
dropout_124 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_183 (Dense)            (None, 1)                 17        
=================================================================
Total params: 79,585
Trainable params: 79,137
Non-trainable params: 448
_________________________________________________________________
