Model: "sequential_64"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_48 (Conv1D)           (None, 59, 32)            6176      
_________________________________________________________________
batch_normalization_44 (Batc (None, 59, 32)            128       
_________________________________________________________________
max_pooling1d_44 (MaxPooling (None, 19, 32)            0         
_________________________________________________________________
conv1d_49 (Conv1D)           (None, 17, 64)            6208      
_________________________________________________________________
batch_normalization_45 (Batc (None, 17, 64)            256       
_________________________________________________________________
max_pooling1d_45 (MaxPooling (None, 5, 64)             0         
_________________________________________________________________
conv1d_50 (Conv1D)           (None, 3, 128)            24704     
_________________________________________________________________
batch_normalization_46 (Batc (None, 3, 128)            512       
_________________________________________________________________
max_pooling1d_46 (MaxPooling (None, 1, 128)            0         
_________________________________________________________________
flatten_19 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_65 (Dense)             (None, 64)                8256      
_________________________________________________________________
dropout_46 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_66 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_47 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_67 (Dense)             (None, 1)                 33        
=================================================================
Total params: 48,353
Trainable params: 47,905
Non-trainable params: 448
_________________________________________________________________
