Model: "sequential_194"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_201 (Conv1D)          (None, 57, 64)            20544     
_________________________________________________________________
batch_normalization_178 (Bat (None, 57, 64)            256       
_________________________________________________________________
max_pooling1d_178 (MaxPoolin (None, 19, 64)            0         
_________________________________________________________________
conv1d_202 (Conv1D)          (None, 15, 128)           41088     
_________________________________________________________________
batch_normalization_179 (Bat (None, 15, 128)           512       
_________________________________________________________________
max_pooling1d_179 (MaxPoolin (None, 5, 128)            0         
_________________________________________________________________
flatten_48 (Flatten)         (None, 640)               0         
_________________________________________________________________
dense_149 (Dense)            (None, 64)                41024     
_________________________________________________________________
dropout_101 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_150 (Dense)            (None, 1)                 65        
=================================================================
Total params: 103,489
Trainable params: 103,105
Non-trainable params: 384
_________________________________________________________________
