Model: "sequential_56"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 128)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 128)           0         
_________________________________________________________________
conv1d_20 (Conv1D)           (None, 31, 32)            4128      
_________________________________________________________________
gru_24 (GRU)                 (None, 31, 64)            18816     
_________________________________________________________________
gru_25 (GRU)                 (None, 31, 64)            24960     
_________________________________________________________________
gru_26 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_19 (Dense)             (None, 1)                 65        
=================================================================
Total params: 72,929
Trainable params: 72,929
Non-trainable params: 0
_________________________________________________________________
