Model: "sequential_32"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_14 (Conv1D)           (None, 59, 64)            12352     
_________________________________________________________________
bidirectional_26 (Bidirectio (None, 59, 256)           148992    
_________________________________________________________________
bidirectional_27 (Bidirectio (None, 59, 256)           296448    
_________________________________________________________________
bidirectional_28 (Bidirectio (None, 59, 256)           296448    
_________________________________________________________________
bidirectional_29 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_14 (Dense)             (None, 1)                 257       
=================================================================
Total params: 1,050,945
Trainable params: 1,050,945
Non-trainable params: 0
_________________________________________________________________
