Model: "sequential_112"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 32)           0         
_________________________________________________________________
conv1d_122 (Conv1D)          (None, 41, 32)            3104      
_________________________________________________________________
batch_normalization_109 (Bat (None, 41, 32)            128       
_________________________________________________________________
max_pooling1d_109 (MaxPoolin (None, 41, 32)            0         
_________________________________________________________________
conv1d_123 (Conv1D)          (None, 13, 64)            6208      
_________________________________________________________________
batch_normalization_110 (Bat (None, 13, 64)            256       
_________________________________________________________________
max_pooling1d_110 (MaxPoolin (None, 13, 64)            0         
_________________________________________________________________
conv1d_124 (Conv1D)          (None, 4, 128)            24704     
_________________________________________________________________
batch_normalization_111 (Bat (None, 4, 128)            512       
_________________________________________________________________
max_pooling1d_111 (MaxPoolin (None, 4, 128)            0         
_________________________________________________________________
conv1d_125 (Conv1D)          (None, 1, 256)            98560     
_________________________________________________________________
batch_normalization_112 (Bat (None, 1, 256)            1024      
_________________________________________________________________
max_pooling1d_112 (MaxPoolin (None, 1, 256)            0         
_________________________________________________________________
flatten_30 (Flatten)         (None, 256)               0         
_________________________________________________________________
dense_100 (Dense)            (None, 64)                16448     
_________________________________________________________________
dropout_70 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_101 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_71 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_102 (Dense)            (None, 1)                 33        
=================================================================
Total params: 153,057
Trainable params: 152,097
Non-trainable params: 960
_________________________________________________________________
