Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 32)           0         
_________________________________________________________________
conv1d (Conv1D)              (None, 125, 32)           1056      
_________________________________________________________________
gru (GRU)                    (None, 125, 64)           18816     
_________________________________________________________________
gru_1 (GRU)                  (None, 64)                24960     
_________________________________________________________________
dense (Dense)                (None, 1)                 65        
=================================================================
Total params: 44,897
Trainable params: 44,897
Non-trainable params: 0
_________________________________________________________________
