Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 250, 64)           0         
_________________________________________________________________
conv1d (Conv1D)              (None, 248, 32)           6176      
_________________________________________________________________
bidirectional (Bidirectional (None, 248, 128)          37632     
_________________________________________________________________
bidirectional_1 (Bidirection (None, 248, 128)          74496     
_________________________________________________________________
bidirectional_2 (Bidirection (None, 128)               74496     
_________________________________________________________________
dense (Dense)                (None, 1)                 129       
=================================================================
Total params: 192,929
Trainable params: 192,929
Non-trainable params: 0
_________________________________________________________________
