Model: "sequential_197"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_207 (Conv1D)          (None, 19, 32)            10272     
_________________________________________________________________
batch_normalization_188 (Bat (None, 19, 32)            128       
_________________________________________________________________
max_pooling1d_188 (MaxPoolin (None, 3, 32)             0         
_________________________________________________________________
flatten_54 (Flatten)         (None, 96)                0         
_________________________________________________________________
dense_171 (Dense)            (None, 64)                6208      
_________________________________________________________________
dropout_117 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_172 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_118 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_173 (Dense)            (None, 1)                 33        
=================================================================
Total params: 18,721
Trainable params: 18,657
Non-trainable params: 64
_________________________________________________________________
