Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 61, 32)            2080      
_________________________________________________________________
gru_19 (GRU)                 (None, 61, 32)            6336      
_________________________________________________________________
gru_20 (GRU)                 (None, 61, 32)            6336      
_________________________________________________________________
gru_21 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 33        
=================================================================
Total params: 21,121
Trainable params: 21,121
Non-trainable params: 0
_________________________________________________________________
