{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_192", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16000], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_97"}}, {"class_name": "Sequential", "config": {"name": "DataPreprocessing", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16000], "dtype": "float32", "sparse": false, "ragged": false, "name": "spectrogram_96_input"}}, {"class_name": "Spectrogram", "config": {"name": "spectrogram_96", "trainable": true, "dtype": "float32", "frame_size": 512, "frame_step": 256, "fft_size": 512}}, {"class_name": "MelSpectrogram", "config": {"name": "mel_spectrogram_96", "trainable": true, "dtype": "float32", "fft_size": 512, "mel_bins": 64, "sample_rate": 16000, "min_freq": 0, "max_freq": 8000}}, {"class_name": "LogMelSpectrogram", "config": {"name": "log_mel_spectrogram_96", "trainable": true, "dtype": "float32"}}]}}, {"class_name": "Sequential", "config": {"name": "DataAugmentation", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 61, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "frequency_mask_96_input"}}, {"class_name": "FrequencyMask", "config": {"name": "frequency_mask_96", "trainable": true, "dtype": "float32", "max_freq_mask": 10}}, {"class_name": "TimeMask", "config": {"name": "time_mask_96", "trainable": true, "dtype": "float32", "max_time_mask": 10}}]}}, {"class_name": "Conv1D", "config": {"name": "conv1d_201", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_178", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_178", "trainable": true, "dtype": "float32", "strides": [3], "pool_size": [3], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_202", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_179", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_179", "trainable": true, "dtype": "float32", "strides": [3], "pool_size": [3], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_48", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_149", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_101", "trainable": true, "dtype": "float32", "rate": 0.19191596566381672, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_150", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": [-2.197224577336219]}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [{"class_name": "Precision", "config": {"name": "precision", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "recall", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "BinaryAccuracy", "config": {"name": "accuracy", "dtype": "float32", "threshold": 0.5}}], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_178/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_178/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_178/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_178/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_179/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_179/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_179/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_179/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv1d_201/kernel", "shape": [5, 64, 64], "dtype": "float32"}, {"name": "conv1d_201/bias", "shape": [64], "dtype": "float32"}, {"name": "conv1d_202/kernel", "shape": [5, 64, 128], "dtype": "float32"}, {"name": "conv1d_202/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_149/kernel", "shape": [640, 64], "dtype": "float32"}, {"name": "dense_149/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_150/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "dense_150/bias", "shape": [1], "dtype": "float32"}]}]}