Model: "sequential_47"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 31, 128)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 31, 128)           0         
_________________________________________________________________
conv1d_17 (Conv1D)           (None, 14, 32)            20512     
_________________________________________________________________
gru_21 (GRU)                 (None, 14, 64)            18816     
_________________________________________________________________
gru_22 (GRU)                 (None, 14, 64)            24960     
_________________________________________________________________
gru_23 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 65        
=================================================================
Total params: 89,313
Trainable params: 89,313
Non-trainable params: 0
_________________________________________________________________
