Model: "sequential_58"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_46 (Conv1D)           (None, 57, 64)            20544     
_________________________________________________________________
batch_normalization_42 (Batc (None, 57, 64)            256       
_________________________________________________________________
max_pooling1d_42 (MaxPooling (None, 19, 64)            0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 1216)              0         
_________________________________________________________________
dense_57 (Dense)             (None, 64)                77888     
_________________________________________________________________
dropout_40 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_58 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_41 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_59 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_42 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_60 (Dense)             (None, 1)                 17        
=================================================================
Total params: 101,313
Trainable params: 101,185
Non-trainable params: 128
_________________________________________________________________
