Model: "sequential_165"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 32)           0         
_________________________________________________________________
conv1d_174 (Conv1D)          (None, 61, 64)            6208      
_________________________________________________________________
batch_normalization_157 (Bat (None, 61, 64)            256       
_________________________________________________________________
max_pooling1d_157 (MaxPoolin (None, 61, 64)            0         
_________________________________________________________________
conv1d_175 (Conv1D)          (None, 30, 128)           24704     
_________________________________________________________________
batch_normalization_158 (Bat (None, 30, 128)           512       
_________________________________________________________________
max_pooling1d_158 (MaxPoolin (None, 30, 128)           0         
_________________________________________________________________
flatten_45 (Flatten)         (None, 3840)              0         
_________________________________________________________________
dense_143 (Dense)            (None, 64)                245824    
_________________________________________________________________
dropout_98 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_144 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_99 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_145 (Dense)            (None, 1)                 33        
=================================================================
Total params: 279,617
Trainable params: 279,233
Non-trainable params: 384
_________________________________________________________________
