Model: "sequential_227"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_244 (Conv1D)          (None, 20, 32)            6176      
_________________________________________________________________
batch_normalization_222 (Bat (None, 20, 32)            128       
_________________________________________________________________
max_pooling1d_222 (MaxPoolin (None, 20, 32)            0         
_________________________________________________________________
flatten_61 (Flatten)         (None, 640)               0         
_________________________________________________________________
dense_188 (Dense)            (None, 64)                41024     
_________________________________________________________________
dropout_127 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_189 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_128 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_190 (Dense)            (None, 1)                 33        
=================================================================
Total params: 49,441
Trainable params: 49,377
Non-trainable params: 64
_________________________________________________________________
