{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16000], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}}, {"class_name": "Sequential", "config": {"name": "DataPreprocessing", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16000], "dtype": "float32", "sparse": false, "ragged": false, "name": "spectrogram_input"}}, {"class_name": "Spectrogram", "config": {"name": "spectrogram", "trainable": true, "dtype": "float32", "frame_size": 512, "frame_step": 256, "fft_size": 512}}, {"class_name": "MelSpectrogram", "config": {"name": "mel_spectrogram", "trainable": true, "dtype": "float32", "fft_size": 512, "mel_bins": 64, "sample_rate": 16000, "min_freq": 0, "max_freq": 8000}}, {"class_name": "LogMelSpectrogram", "config": {"name": "log_mel_spectrogram", "trainable": true, "dtype": "float32"}}]}}, {"class_name": "Sequential", "config": {"name": "DataAugmentation", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 61, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "frequency_mask_input"}}, {"class_name": "FrequencyMask", "config": {"name": "frequency_mask", "trainable": true, "dtype": "float32", "max_freq_mask": 10}}, {"class_name": "TimeMask", "config": {"name": "time_mask", "trainable": true, "dtype": "float32", "max_time_mask": 10}}]}}, {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "GRU", "config": {"name": "gru", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}}, {"class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}}, {"class_name": "GRU", "config": {"name": "gru_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}}, {"class_name": "GRU", "config": {"name": "gru_3", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": [-2.8922790634524325]}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [{"class_name": "Precision", "config": {"name": "precision", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "recall", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "BinaryAccuracy", "config": {"name": "accuracy", "dtype": "float32", "threshold": 0.5}}], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv1d/kernel", "shape": [1, 64, 32], "dtype": "float32"}, {"name": "conv1d/bias", "shape": [32], "dtype": "float32"}, {"name": "dense/kernel", "shape": [128, 1], "dtype": "float32"}, {"name": "dense/bias", "shape": [1], "dtype": "float32"}, {"name": "gru/gru_cell/kernel", "shape": [32, 384], "dtype": "float32"}, {"name": "gru/gru_cell/recurrent_kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "gru/gru_cell/bias", "shape": [2, 384], "dtype": "float32"}, {"name": "gru_1/gru_cell_1/kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "gru_1/gru_cell_1/recurrent_kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "gru_1/gru_cell_1/bias", "shape": [2, 384], "dtype": "float32"}, {"name": "gru_2/gru_cell_2/kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "gru_2/gru_cell_2/recurrent_kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "gru_2/gru_cell_2/bias", "shape": [2, 384], "dtype": "float32"}, {"name": "gru_3/gru_cell_3/kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "gru_3/gru_cell_3/recurrent_kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "gru_3/gru_cell_3/bias", "shape": [2, 384], "dtype": "float32"}]}]}