Model: "sequential_125"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 122, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 122, 128)          0         
_________________________________________________________________
conv1d_134 (Conv1D)          (None, 59, 32)            20512     
_________________________________________________________________
batch_normalization_120 (Bat (None, 59, 32)            128       
_________________________________________________________________
max_pooling1d_120 (MaxPoolin (None, 11, 32)            0         
_________________________________________________________________
flatten_34 (Flatten)         (None, 352)               0         
_________________________________________________________________
dense_109 (Dense)            (None, 64)                22592     
_________________________________________________________________
dropout_75 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_110 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_76 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_111 (Dense)            (None, 1)                 33        
=================================================================
Total params: 45,345
Trainable params: 45,281
Non-trainable params: 64
_________________________________________________________________
