Model: "sequential_32"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 32)           0         
_________________________________________________________________
conv1d_12 (Conv1D)           (None, 41, 32)            3104      
_________________________________________________________________
bidirectional_11 (Bidirectio (None, 41, 64)            12672     
_________________________________________________________________
bidirectional_12 (Bidirectio (None, 41, 64)            18816     
_________________________________________________________________
bidirectional_13 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_11 (Dense)             (None, 1)                 65        
=================================================================
Total params: 53,473
Trainable params: 53,473
Non-trainable params: 0
_________________________________________________________________
