Model: "sequential_75"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_25 (Conv1D)           (None, 30, 32)            6176      
_________________________________________________________________
bidirectional_28 (Bidirectio (None, 30, 128)           37632     
_________________________________________________________________
bidirectional_29 (Bidirectio (None, 30, 128)           74496     
_________________________________________________________________
bidirectional_30 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_25 (Dense)             (None, 1)                 129       
=================================================================
Total params: 192,929
Trainable params: 192,929
Non-trainable params: 0
_________________________________________________________________
