Model: "sequential_85"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 59, 16)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 59, 16)            0         
_________________________________________________________________
conv1d_89 (Conv1D)           (None, 55, 32)            2592      
_________________________________________________________________
batch_normalization_79 (Batc (None, 55, 32)            128       
_________________________________________________________________
max_pooling1d_79 (MaxPooling (None, 55, 32)            0         
_________________________________________________________________
conv1d_90 (Conv1D)           (None, 51, 64)            10304     
_________________________________________________________________
batch_normalization_80 (Batc (None, 51, 64)            256       
_________________________________________________________________
max_pooling1d_80 (MaxPooling (None, 51, 64)            0         
_________________________________________________________________
conv1d_91 (Conv1D)           (None, 47, 128)           41088     
_________________________________________________________________
batch_normalization_81 (Batc (None, 47, 128)           512       
_________________________________________________________________
max_pooling1d_81 (MaxPooling (None, 47, 128)           0         
_________________________________________________________________
conv1d_92 (Conv1D)           (None, 43, 256)           164096    
_________________________________________________________________
batch_normalization_82 (Batc (None, 43, 256)           1024      
_________________________________________________________________
max_pooling1d_82 (MaxPooling (None, 43, 256)           0         
_________________________________________________________________
flatten_23 (Flatten)         (None, 11008)             0         
_________________________________________________________________
dense_74 (Dense)             (None, 64)                704576    
_________________________________________________________________
dropout_51 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_75 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_52 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_76 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_53 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_77 (Dense)             (None, 1)                 17        
=================================================================
Total params: 927,201
Trainable params: 926,241
Non-trainable params: 960
_________________________________________________________________
