Model: "sequential_66"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_22 (Conv1D)           (None, 19, 64)            20544     
_________________________________________________________________
gru_65 (GRU)                 (None, 19, 128)           74496     
_________________________________________________________________
gru_66 (GRU)                 (None, 19, 128)           99072     
_________________________________________________________________
gru_67 (GRU)                 (None, 19, 128)           99072     
_________________________________________________________________
gru_68 (GRU)                 (None, 128)               99072     
_________________________________________________________________
dense_22 (Dense)             (None, 1)                 129       
=================================================================
Total params: 392,385
Trainable params: 392,385
Non-trainable params: 0
_________________________________________________________________
