Model: "sequential_35"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 16)           0         
_________________________________________________________________
conv1d_13 (Conv1D)           (None, 42, 64)            1088      
_________________________________________________________________
bidirectional_14 (Bidirectio (None, 42, 256)           197632    
_________________________________________________________________
bidirectional_15 (Bidirectio (None, 42, 256)           394240    
_________________________________________________________________
bidirectional_16 (Bidirectio (None, 42, 256)           394240    
_________________________________________________________________
bidirectional_17 (Bidirectio (None, 256)               394240    
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 257       
=================================================================
Total params: 1,381,697
Trainable params: 1,381,697
Non-trainable params: 0
_________________________________________________________________
