Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 1000, 16)          0         
_________________________________________________________________
conv1d (Conv1D)              (None, 334, 64)           1088      
_________________________________________________________________
bidirectional (Bidirectional (None, 334, 256)          197632    
_________________________________________________________________
bidirectional_1 (Bidirection (None, 334, 256)          394240    
_________________________________________________________________
bidirectional_2 (Bidirection (None, 334, 256)          394240    
_________________________________________________________________
bidirectional_3 (Bidirection (None, 256)               394240    
_________________________________________________________________
dense (Dense)                (None, 1)                 257       
=================================================================
Total params: 1,381,697
Trainable params: 1,381,697
Non-trainable params: 0
_________________________________________________________________
