Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 15, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 15, 64)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 8, 64)             4160      
_________________________________________________________________
gru_2 (GRU)                  (None, 8, 32)             9408      
_________________________________________________________________
gru_3 (GRU)                  (None, 8, 32)             6336      
_________________________________________________________________
gru_4 (GRU)                  (None, 32)                6336      
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 33        
=================================================================
Total params: 26,273
Trainable params: 26,273
Non-trainable params: 0
_________________________________________________________________
