Model: "sequential_107"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 15, 32)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 15, 32)            0         
_________________________________________________________________
conv1d_37 (Conv1D)           (None, 8, 64)             2112      
_________________________________________________________________
gru_55 (GRU)                 (None, 128)               74496     
_________________________________________________________________
dense_36 (Dense)             (None, 1)                 129       
=================================================================
Total params: 76,737
Trainable params: 76,737
Non-trainable params: 0
_________________________________________________________________
