Model: "sequential_93"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_31 (Conv1D)           (None, 31, 32)            2080      
_________________________________________________________________
gru_95 (GRU)                 (None, 31, 32)            6336      
_________________________________________________________________
gru_96 (GRU)                 (None, 31, 32)            6336      
_________________________________________________________________
gru_97 (GRU)                 (None, 31, 32)            6336      
_________________________________________________________________
gru_98 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_31 (Dense)             (None, 1)                 33        
=================================================================
Total params: 27,457
Trainable params: 27,457
Non-trainable params: 0
_________________________________________________________________
