Model: "sequential_36"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_33 (Conv1D)           (None, 57, 32)            10272     
_________________________________________________________________
batch_normalization_30 (Batc (None, 57, 32)            128       
_________________________________________________________________
max_pooling1d_30 (MaxPooling (None, 19, 32)            0         
_________________________________________________________________
conv1d_34 (Conv1D)           (None, 15, 64)            10304     
_________________________________________________________________
batch_normalization_31 (Batc (None, 15, 64)            256       
_________________________________________________________________
max_pooling1d_31 (MaxPooling (None, 5, 64)             0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 320)               0         
_________________________________________________________________
dense_34 (Dense)             (None, 64)                20544     
_________________________________________________________________
dropout_24 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_35 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_25 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_36 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_26 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_37 (Dense)             (None, 1)                 17        
=================================================================
Total params: 44,129
Trainable params: 43,937
Non-trainable params: 192
_________________________________________________________________
