Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_15 (Conv1D)           (None, 30, 32)            6176      
_________________________________________________________________
batch_normalization_12 (Batc (None, 30, 32)            128       
_________________________________________________________________
max_pooling1d_12 (MaxPooling (None, 10, 32)            0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 320)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 64)                20544     
_________________________________________________________________
dropout_5 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_8 (Dense)              (None, 32)                2080      
_________________________________________________________________
dropout_6 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 33        
=================================================================
Total params: 28,961
Trainable params: 28,897
Non-trainable params: 64
_________________________________________________________________
