Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 32)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 41, 32)            3104      
_________________________________________________________________
batch_normalization_3 (Batch (None, 41, 32)            128       
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 41, 32)            0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 13, 64)            6208      
_________________________________________________________________
batch_normalization_4 (Batch (None, 13, 64)            256       
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 13, 64)            0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 832)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 64)                53312     
_________________________________________________________________
dropout_3 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 32)                2080      
_________________________________________________________________
dropout_4 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 16)                528       
_________________________________________________________________
dropout_5 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 17        
=================================================================
Total params: 65,633
Trainable params: 65,441
Non-trainable params: 192
_________________________________________________________________
