Model: "sequential_220"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 30, 16)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 30, 16)            0         
_________________________________________________________________
conv1d_235 (Conv1D)          (None, 26, 64)            5184      
_________________________________________________________________
batch_normalization_214 (Bat (None, 26, 64)            256       
_________________________________________________________________
max_pooling1d_214 (MaxPoolin (None, 8, 64)             0         
_________________________________________________________________
conv1d_236 (Conv1D)          (None, 4, 128)            41088     
_________________________________________________________________
batch_normalization_215 (Bat (None, 4, 128)            512       
_________________________________________________________________
max_pooling1d_215 (MaxPoolin (None, 1, 128)            0         
_________________________________________________________________
flatten_59 (Flatten)         (None, 128)               0         
_________________________________________________________________
dense_184 (Dense)            (None, 64)                8256      
_________________________________________________________________
dropout_125 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_185 (Dense)            (None, 1)                 65        
=================================================================
Total params: 55,361
Trainable params: 54,977
Non-trainable params: 384
_________________________________________________________________
