Model: "sequential_54"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_18 (Conv1D)           (None, 30, 32)            6176      
_________________________________________________________________
gru_54 (GRU)                 (None, 30, 128)           62208     
_________________________________________________________________
gru_55 (GRU)                 (None, 30, 128)           99072     
_________________________________________________________________
gru_56 (GRU)                 (None, 30, 128)           99072     
_________________________________________________________________
gru_57 (GRU)                 (None, 128)               99072     
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 129       
=================================================================
Total params: 365,729
Trainable params: 365,729
Non-trainable params: 0
_________________________________________________________________
