Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 4000, 4)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 1998, 64)          1344      
_________________________________________________________________
bidirectional_1 (Bidirection (None, 1998, 128)         49920     
_________________________________________________________________
bidirectional_2 (Bidirection (None, 128)               74496     
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 129       
=================================================================
Total params: 125,889
Trainable params: 125,889
Non-trainable params: 0
_________________________________________________________________
