Model: "sequential_105"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_35 (Conv1D)           (None, 20, 64)            12352     
_________________________________________________________________
bidirectional_45 (Bidirectio (None, 20, 256)           148992    
_________________________________________________________________
bidirectional_46 (Bidirectio (None, 20, 256)           296448    
_________________________________________________________________
bidirectional_47 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_35 (Dense)             (None, 1)                 257       
=================================================================
Total params: 754,497
Trainable params: 754,497
Non-trainable params: 0
_________________________________________________________________
