Model: "sequential_26"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 128)          0         
_________________________________________________________________
conv1d_26 (Conv1D)           (None, 61, 32)            12320     
_________________________________________________________________
batch_normalization_22 (Batc (None, 61, 32)            128       
_________________________________________________________________
max_pooling1d_22 (MaxPooling (None, 20, 32)            0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 640)               0         
_________________________________________________________________
dense_24 (Dense)             (None, 64)                41024     
_________________________________________________________________
dropout_16 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_25 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_17 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_26 (Dense)             (None, 1)                 33        
=================================================================
Total params: 55,585
Trainable params: 55,521
Non-trainable params: 64
_________________________________________________________________
