Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_2 (Reshape)          (None, 1000, 16)          0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 1000, 64)          9600      
_________________________________________________________________
bidirectional_2 (Bidirection (None, 1000, 64)          18816     
_________________________________________________________________
bidirectional_3 (Bidirection (None, 1000, 64)          18816     
_________________________________________________________________
bidirectional_4 (Bidirection (None, 64)                18816     
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 65        
=================================================================
Total params: 66,113
Trainable params: 66,113
Non-trainable params: 0
_________________________________________________________________
