Model: "sequential_95"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 64)            0         
_________________________________________________________________
conv1d_33 (Conv1D)           (None, 31, 64)            4160      
_________________________________________________________________
bidirectional_34 (Bidirectio (None, 31, 64)            18816     
_________________________________________________________________
bidirectional_35 (Bidirectio (None, 31, 64)            18816     
_________________________________________________________________
bidirectional_36 (Bidirectio (None, 31, 64)            18816     
_________________________________________________________________
bidirectional_37 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_32 (Dense)             (None, 1)                 65        
=================================================================
Total params: 79,489
Trainable params: 79,489
Non-trainable params: 0
_________________________________________________________________
