Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 500, 32)           0         
_________________________________________________________________
conv1d (Conv1D)              (None, 243, 32)           15392     
_________________________________________________________________
gru (GRU)                    (None, 243, 128)          62208     
_________________________________________________________________
gru_1 (GRU)                  (None, 243, 128)          99072     
_________________________________________________________________
gru_2 (GRU)                  (None, 128)               99072     
_________________________________________________________________
dense (Dense)                (None, 1)                 129       
=================================================================
Total params: 275,873
Trainable params: 275,873
Non-trainable params: 0
_________________________________________________________________
