Model: "sequential_47"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 128)          0         
_________________________________________________________________
conv1d_52 (Conv1D)           (None, 122, 32)           12320     
_________________________________________________________________
batch_normalization_46 (Batc (None, 122, 32)           128       
_________________________________________________________________
max_pooling1d_46 (MaxPooling (None, 40, 32)            0         
_________________________________________________________________
flatten_13 (Flatten)         (None, 1280)              0         
_________________________________________________________________
dense_43 (Dense)             (None, 64)                81984     
_________________________________________________________________
dropout_30 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_44 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_31 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_45 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_32 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_46 (Dense)             (None, 1)                 17        
=================================================================
Total params: 97,057
Trainable params: 96,993
Non-trainable params: 64
_________________________________________________________________
