Model: "sequential_50"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 128)          0         
_________________________________________________________________
conv1d_18 (Conv1D)           (None, 61, 32)            12320     
_________________________________________________________________
lstm_17 (LSTM)               (None, 61, 64)            24832     
_________________________________________________________________
lstm_18 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_17 (Dense)             (None, 1)                 65        
=================================================================
Total params: 70,241
Trainable params: 70,241
Non-trainable params: 0
_________________________________________________________________
