Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_2 (Reshape)          (None, 500, 32)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 166, 32)           3104      
_________________________________________________________________
lstm_4 (LSTM)                (None, 32)                8320      
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 33        
=================================================================
Total params: 11,457
Trainable params: 11,457
Non-trainable params: 0
_________________________________________________________________
