Model: "sequential_27"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_26 (Conv1D)           (None, 59, 32)            6176      
_________________________________________________________________
batch_normalization_23 (Batc (None, 59, 32)            128       
_________________________________________________________________
max_pooling1d_23 (MaxPooling (None, 19, 32)            0         
_________________________________________________________________
conv1d_27 (Conv1D)           (None, 17, 64)            6208      
_________________________________________________________________
batch_normalization_24 (Batc (None, 17, 64)            256       
_________________________________________________________________
max_pooling1d_24 (MaxPooling (None, 5, 64)             0         
_________________________________________________________________
conv1d_28 (Conv1D)           (None, 3, 128)            24704     
_________________________________________________________________
batch_normalization_25 (Batc (None, 3, 128)            512       
_________________________________________________________________
max_pooling1d_25 (MaxPooling (None, 1, 128)            0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 128)               0         
_________________________________________________________________
dense_25 (Dense)             (None, 64)                8256      
_________________________________________________________________
dropout_18 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_26 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_19 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_27 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_20 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_28 (Dense)             (None, 1)                 17        
=================================================================
Total params: 48,865
Trainable params: 48,417
Non-trainable params: 448
_________________________________________________________________
