Model: "sequential_44"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_18 (Conv1D)           (None, 20, 64)            12352     
_________________________________________________________________
bidirectional_34 (Bidirectio (None, 20, 64)            18816     
_________________________________________________________________
bidirectional_35 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 65        
=================================================================
Total params: 50,049
Trainable params: 50,049
Non-trainable params: 0
_________________________________________________________________
