Model: "sequential_57"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_19 (Conv1D)           (None, 29, 64)            20544     
_________________________________________________________________
gru_56 (GRU)                 (None, 29, 128)           74496     
_________________________________________________________________
gru_57 (GRU)                 (None, 29, 128)           99072     
_________________________________________________________________
gru_58 (GRU)                 (None, 29, 128)           99072     
_________________________________________________________________
gru_59 (GRU)                 (None, 128)               99072     
_________________________________________________________________
dense_19 (Dense)             (None, 1)                 129       
=================================================================
Total params: 392,385
Trainable params: 392,385
Non-trainable params: 0
_________________________________________________________________
