Model: "sequential_98"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 30, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 30, 64)            0         
_________________________________________________________________
conv1d_34 (Conv1D)           (None, 30, 32)            2080      
_________________________________________________________________
gru_46 (GRU)                 (None, 30, 128)           62208     
_________________________________________________________________
gru_47 (GRU)                 (None, 30, 128)           99072     
_________________________________________________________________
gru_48 (GRU)                 (None, 128)               99072     
_________________________________________________________________
dense_33 (Dense)             (None, 1)                 129       
=================================================================
Total params: 262,561
Trainable params: 262,561
Non-trainable params: 0
_________________________________________________________________
