Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 19, 64)            20544     
_________________________________________________________________
bidirectional_17 (Bidirectio (None, 19, 128)           49920     
_________________________________________________________________
bidirectional_18 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 129       
=================================================================
Total params: 145,089
Trainable params: 145,089
Non-trainable params: 0
_________________________________________________________________
