Model: "sequential_38"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_16 (Conv1D)           (None, 31, 64)            4160      
_________________________________________________________________
bidirectional_30 (Bidirectio (None, 31, 128)           49920     
_________________________________________________________________
bidirectional_31 (Bidirectio (None, 31, 128)           74496     
_________________________________________________________________
bidirectional_32 (Bidirectio (None, 31, 128)           74496     
_________________________________________________________________
bidirectional_33 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 129       
=================================================================
Total params: 277,697
Trainable params: 277,697
Non-trainable params: 0
_________________________________________________________________
