Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 29, 32)            10272     
_________________________________________________________________
bidirectional (Bidirectional (None, 29, 256)           124416    
_________________________________________________________________
bidirectional_1 (Bidirection (None, 29, 256)           296448    
_________________________________________________________________
bidirectional_2 (Bidirection (None, 256)               296448    
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 257       
=================================================================
Total params: 727,841
Trainable params: 727,841
Non-trainable params: 0
_________________________________________________________________
