Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 64)           0         
_________________________________________________________________
conv1d (Conv1D)              (None, 121, 64)           20544     
_________________________________________________________________
batch_normalization (BatchNo (None, 121, 64)           256       
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 40, 64)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 36, 128)           41088     
_________________________________________________________________
batch_normalization_1 (Batch (None, 36, 128)           512       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 12, 128)           0         
_________________________________________________________________
flatten (Flatten)            (None, 1536)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                98368     
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
=================================================================
Total params: 160,833
Trainable params: 160,449
Non-trainable params: 384
_________________________________________________________________
