Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 3200, 5)           0         
_________________________________________________________________
conv1d (Conv1D)              (None, 797, 32)           2432      
_________________________________________________________________
bidirectional (Bidirectional (None, 128)               37632     
_________________________________________________________________
dense (Dense)                (None, 1)                 129       
=================================================================
Total params: 40,193
Trainable params: 40,193
Non-trainable params: 0
_________________________________________________________________
