Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_17 (Conv1D)           (None, 30, 32)            6176      
_________________________________________________________________
batch_normalization_14 (Batc (None, 30, 32)            128       
_________________________________________________________________
max_pooling1d_14 (MaxPooling (None, 30, 32)            0         
_________________________________________________________________
conv1d_18 (Conv1D)           (None, 14, 64)            6208      
_________________________________________________________________
batch_normalization_15 (Batc (None, 14, 64)            256       
_________________________________________________________________
max_pooling1d_15 (MaxPooling (None, 14, 64)            0         
_________________________________________________________________
conv1d_19 (Conv1D)           (None, 6, 128)            24704     
_________________________________________________________________
batch_normalization_16 (Batc (None, 6, 128)            512       
_________________________________________________________________
max_pooling1d_16 (MaxPooling (None, 6, 128)            0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 768)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 64)                49216     
_________________________________________________________________
dropout_10 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_15 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_11 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_16 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_12 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_17 (Dense)             (None, 1)                 17        
=================================================================
Total params: 89,825
Trainable params: 89,377
Non-trainable params: 448
_________________________________________________________________
