Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_7 (Reshape)          (None, 1000, 16)          0         
_________________________________________________________________
gru_19 (GRU)                 (None, 1000, 64)          15744     
_________________________________________________________________
gru_20 (GRU)                 (None, 1000, 64)          24960     
_________________________________________________________________
gru_21 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 65        
=================================================================
Total params: 65,729
Trainable params: 65,729
Non-trainable params: 0
_________________________________________________________________
