Model: "sequential_42"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_36 (Conv1D)           (None, 29, 32)            10272     
_________________________________________________________________
batch_normalization_33 (Batc (None, 29, 32)            128       
_________________________________________________________________
max_pooling1d_33 (MaxPooling (None, 29, 32)            0         
_________________________________________________________________
conv1d_37 (Conv1D)           (None, 13, 64)            10304     
_________________________________________________________________
batch_normalization_34 (Batc (None, 13, 64)            256       
_________________________________________________________________
max_pooling1d_34 (MaxPooling (None, 13, 64)            0         
_________________________________________________________________
flatten_12 (Flatten)         (None, 832)               0         
_________________________________________________________________
dense_41 (Dense)             (None, 64)                53312     
_________________________________________________________________
dropout_29 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_42 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_30 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_43 (Dense)             (None, 1)                 33        
=================================================================
Total params: 76,385
Trainable params: 76,193
Non-trainable params: 192
_________________________________________________________________
