Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 29, 64)            20544     
_________________________________________________________________
gru_15 (GRU)                 (None, 29, 64)            24960     
_________________________________________________________________
gru_16 (GRU)                 (None, 29, 64)            24960     
_________________________________________________________________
gru_17 (GRU)                 (None, 29, 64)            24960     
_________________________________________________________________
gru_18 (GRU)                 (None, 64)                24960     
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 65        
=================================================================
Total params: 120,449
Trainable params: 120,449
Non-trainable params: 0
_________________________________________________________________
