Model: "sequential_25"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_12 (Reshape)         (None, 1000, 16)          0         
_________________________________________________________________
lstm_11 (LSTM)               (None, 1000, 32)          6272      
_________________________________________________________________
lstm_12 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 33        
=================================================================
Total params: 14,625
Trainable params: 14,625
Non-trainable params: 0
_________________________________________________________________
