Model: "sequential_74"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 64)            0         
_________________________________________________________________
conv1d_26 (Conv1D)           (None, 58, 32)            10272     
_________________________________________________________________
bidirectional_24 (Bidirectio (None, 256)               164864    
_________________________________________________________________
dense_25 (Dense)             (None, 1)                 257       
=================================================================
Total params: 175,393
Trainable params: 175,393
Non-trainable params: 0
_________________________________________________________________
