Model: "sequential_151"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 32)           0         
_________________________________________________________________
conv1d_161 (Conv1D)          (None, 121, 32)           5152      
_________________________________________________________________
batch_normalization_145 (Bat (None, 121, 32)           128       
_________________________________________________________________
max_pooling1d_145 (MaxPoolin (None, 40, 32)            0         
_________________________________________________________________
flatten_41 (Flatten)         (None, 1280)              0         
_________________________________________________________________
dense_133 (Dense)            (None, 64)                81984     
_________________________________________________________________
dropout_92 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_134 (Dense)            (None, 1)                 65        
=================================================================
Total params: 87,329
Trainable params: 87,265
Non-trainable params: 64
_________________________________________________________________
