Model: "sequential_110"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 128)          0         
_________________________________________________________________
conv1d_38 (Conv1D)           (None, 62, 64)            24640     
_________________________________________________________________
bidirectional_40 (Bidirectio (None, 62, 256)           148992    
_________________________________________________________________
bidirectional_41 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_37 (Dense)             (None, 1)                 257       
=================================================================
Total params: 470,337
Trainable params: 470,337
Non-trainable params: 0
_________________________________________________________________
