Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 16)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 16)            0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 30, 64)            3136      
_________________________________________________________________
batch_normalization_4 (Batch (None, 30, 64)            256       
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 30, 64)            0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 14, 128)           24704     
_________________________________________________________________
batch_normalization_5 (Batch (None, 14, 128)           512       
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 14, 128)           0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 6, 256)            98560     
_________________________________________________________________
batch_normalization_6 (Batch (None, 6, 256)            1024      
_________________________________________________________________
max_pooling1d_6 (MaxPooling1 (None, 6, 256)            0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 2, 512)            393728    
_________________________________________________________________
batch_normalization_7 (Batch (None, 2, 512)            2048      
_________________________________________________________________
max_pooling1d_7 (MaxPooling1 (None, 2, 512)            0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                65600     
_________________________________________________________________
dropout_3 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 65        
=================================================================
Total params: 589,633
Trainable params: 587,713
Non-trainable params: 1,920
_________________________________________________________________
