Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 21, 32)            2080      
_________________________________________________________________
bidirectional_10 (Bidirectio (None, 21, 128)           37632     
_________________________________________________________________
bidirectional_11 (Bidirectio (None, 21, 128)           74496     
_________________________________________________________________
bidirectional_12 (Bidirectio (None, 21, 128)           74496     
_________________________________________________________________
bidirectional_13 (Bidirectio (None, 128)               74496     
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 129       
=================================================================
Total params: 263,329
Trainable params: 263,329
Non-trainable params: 0
_________________________________________________________________
