Model: "sequential_77"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 16)           0         
_________________________________________________________________
conv1d_27 (Conv1D)           (None, 62, 64)            1088      
_________________________________________________________________
bidirectional_25 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_26 (Dense)             (None, 1)                 65        
=================================================================
Total params: 19,969
Trainable params: 19,969
Non-trainable params: 0
_________________________________________________________________
