Model: "sequential_60"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_20 (Conv1D)           (None, 31, 32)            2080      
_________________________________________________________________
gru_62 (GRU)                 (None, 31, 32)            6336      
_________________________________________________________________
gru_63 (GRU)                 (None, 31, 32)            6336      
_________________________________________________________________
gru_64 (GRU)                 (None, 31, 32)            6336      
_________________________________________________________________
gru_65 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_20 (Dense)             (None, 1)                 33        
=================================================================
Total params: 27,457
Trainable params: 27,457
Non-trainable params: 0
_________________________________________________________________
