Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 21, 64)            4160      
_________________________________________________________________
gru_2 (GRU)                  (None, 21, 128)           74496     
_________________________________________________________________
gru_3 (GRU)                  (None, 21, 128)           99072     
_________________________________________________________________
gru_4 (GRU)                  (None, 21, 128)           99072     
_________________________________________________________________
gru_5 (GRU)                  (None, 128)               99072     
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 129       
=================================================================
Total params: 376,001
Trainable params: 376,001
Non-trainable params: 0
_________________________________________________________________
