Model: "sequential_125"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 32)           0         
_________________________________________________________________
conv1d_43 (Conv1D)           (None, 125, 32)           1056      
_________________________________________________________________
bidirectional_46 (Bidirectio (None, 125, 64)           12672     
_________________________________________________________________
bidirectional_47 (Bidirectio (None, 125, 64)           18816     
_________________________________________________________________
bidirectional_48 (Bidirectio (None, 125, 64)           18816     
_________________________________________________________________
bidirectional_49 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_42 (Dense)             (None, 1)                 65        
=================================================================
Total params: 70,241
Trainable params: 70,241
Non-trainable params: 0
_________________________________________________________________
