Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 59, 32)            6176      
_________________________________________________________________
bidirectional_14 (Bidirectio (None, 59, 64)            12672     
_________________________________________________________________
bidirectional_15 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 65        
=================================================================
Total params: 37,729
Trainable params: 37,729
Non-trainable params: 0
_________________________________________________________________
