Model: "sequential_135"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_45 (Conv1D)           (None, 57, 64)            20544     
_________________________________________________________________
gru_133 (GRU)                (None, 57, 32)            9408      
_________________________________________________________________
gru_134 (GRU)                (None, 57, 32)            6336      
_________________________________________________________________
gru_135 (GRU)                (None, 57, 32)            6336      
_________________________________________________________________
gru_136 (GRU)                (None, 32)                6336      
_________________________________________________________________
dense_45 (Dense)             (None, 1)                 33        
=================================================================
Total params: 48,993
Trainable params: 48,993
Non-trainable params: 0
_________________________________________________________________
