Model: "sequential_42"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_14 (Conv1D)           (None, 20, 32)            6176      
_________________________________________________________________
gru_40 (GRU)                 (None, 20, 32)            6336      
_________________________________________________________________
gru_41 (GRU)                 (None, 20, 32)            6336      
_________________________________________________________________
gru_42 (GRU)                 (None, 20, 32)            6336      
_________________________________________________________________
gru_43 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_14 (Dense)             (None, 1)                 33        
=================================================================
Total params: 31,553
Trainable params: 31,553
Non-trainable params: 0
_________________________________________________________________
