Model: "sequential_65"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 16)           0         
_________________________________________________________________
conv1d_74 (Conv1D)           (None, 61, 32)            1568      
_________________________________________________________________
batch_normalization_66 (Batc (None, 61, 32)            128       
_________________________________________________________________
max_pooling1d_66 (MaxPooling (None, 20, 32)            0         
_________________________________________________________________
conv1d_75 (Conv1D)           (None, 9, 64)             6208      
_________________________________________________________________
batch_normalization_67 (Batc (None, 9, 64)             256       
_________________________________________________________________
max_pooling1d_67 (MaxPooling (None, 3, 64)             0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 192)               0         
_________________________________________________________________
dense_56 (Dense)             (None, 64)                12352     
_________________________________________________________________
dropout_39 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_57 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_40 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_58 (Dense)             (None, 1)                 33        
=================================================================
Total params: 22,625
Trainable params: 22,433
Non-trainable params: 192
_________________________________________________________________
