Model: "sequential_22"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_9 (Reshape)          (None, 1000, 16)          0         
_________________________________________________________________
lstm_7 (LSTM)                (None, 1000, 64)          20736     
_________________________________________________________________
lstm_8 (LSTM)                (None, 1000, 64)          33024     
_________________________________________________________________
lstm_9 (LSTM)                (None, 1000, 64)          33024     
_________________________________________________________________
lstm_10 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 65        
=================================================================
Total params: 119,873
Trainable params: 119,873
Non-trainable params: 0
_________________________________________________________________
