Model: "sequential_122"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 16)           0         
_________________________________________________________________
conv1d_133 (Conv1D)          (None, 61, 64)            3136      
_________________________________________________________________
batch_normalization_119 (Bat (None, 61, 64)            256       
_________________________________________________________________
max_pooling1d_119 (MaxPoolin (None, 61, 64)            0         
_________________________________________________________________
flatten_33 (Flatten)         (None, 3904)              0         
_________________________________________________________________
dense_107 (Dense)            (None, 64)                249920    
_________________________________________________________________
dropout_74 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_108 (Dense)            (None, 1)                 65        
=================================================================
Total params: 253,377
Trainable params: 253,249
Non-trainable params: 128
_________________________________________________________________
