Model: "sequential_146"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 31, 16)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 31, 16)            0         
_________________________________________________________________
conv1d_151 (Conv1D)          (None, 14, 64)            5184      
_________________________________________________________________
batch_normalization_136 (Bat (None, 14, 64)            256       
_________________________________________________________________
max_pooling1d_136 (MaxPoolin (None, 14, 64)            0         
_________________________________________________________________
conv1d_152 (Conv1D)          (None, 5, 128)            41088     
_________________________________________________________________
batch_normalization_137 (Bat (None, 5, 128)            512       
_________________________________________________________________
max_pooling1d_137 (MaxPoolin (None, 5, 128)            0         
_________________________________________________________________
conv1d_153 (Conv1D)          (None, 1, 256)            164096    
_________________________________________________________________
batch_normalization_138 (Bat (None, 1, 256)            1024      
_________________________________________________________________
max_pooling1d_138 (MaxPoolin (None, 1, 256)            0         
_________________________________________________________________
flatten_40 (Flatten)         (None, 256)               0         
_________________________________________________________________
dense_130 (Dense)            (None, 64)                16448     
_________________________________________________________________
dropout_90 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_131 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_91 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_132 (Dense)            (None, 1)                 33        
=================================================================
Total params: 230,721
Trainable params: 229,825
Non-trainable params: 896
_________________________________________________________________
