Model: "sequential_45"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_15 (Conv1D)           (None, 29, 64)            20544     
_________________________________________________________________
bidirectional_20 (Bidirectio (None, 29, 64)            18816     
_________________________________________________________________
bidirectional_21 (Bidirectio (None, 64)                18816     
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 65        
=================================================================
Total params: 58,241
Trainable params: 58,241
Non-trainable params: 0
_________________________________________________________________
