Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 128)          0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 128)          0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 123, 32)           12320     
_________________________________________________________________
gru_5 (GRU)                  (None, 64)                18816     
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 65        
=================================================================
Total params: 31,201
Trainable params: 31,201
Non-trainable params: 0
_________________________________________________________________
