Model: "sequential_30"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 31, 32)            2080      
_________________________________________________________________
gru_30 (GRU)                 (None, 31, 32)            6336      
_________________________________________________________________
gru_31 (GRU)                 (None, 31, 32)            6336      
_________________________________________________________________
gru_32 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 33        
=================================================================
Total params: 21,121
Trainable params: 21,121
Non-trainable params: 0
_________________________________________________________________
