Model: "sequential_123"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_41 (Conv1D)           (None, 59, 32)            6176      
_________________________________________________________________
gru_121 (GRU)                (None, 59, 32)            6336      
_________________________________________________________________
gru_122 (GRU)                (None, 59, 32)            6336      
_________________________________________________________________
gru_123 (GRU)                (None, 59, 32)            6336      
_________________________________________________________________
gru_124 (GRU)                (None, 32)                6336      
_________________________________________________________________
dense_41 (Dense)             (None, 1)                 33        
=================================================================
Total params: 31,553
Trainable params: 31,553
Non-trainable params: 0
_________________________________________________________________
