Model: "sequential_26"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_13 (Reshape)         (None, 1000, 16)          0         
_________________________________________________________________
bidirectional_10 (Bidirectio (None, 1000, 64)          12544     
_________________________________________________________________
bidirectional_11 (Bidirectio (None, 1000, 64)          24832     
_________________________________________________________________
bidirectional_12 (Bidirectio (None, 1000, 64)          24832     
_________________________________________________________________
bidirectional_13 (Bidirectio (None, 64)                24832     
_________________________________________________________________
dense_13 (Dense)             (None, 1)                 65        
=================================================================
Total params: 87,105
Trainable params: 87,105
Non-trainable params: 0
_________________________________________________________________
