Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 59, 64)            12352     
_________________________________________________________________
gru_3 (GRU)                  (None, 59, 32)            9408      
_________________________________________________________________
gru_4 (GRU)                  (None, 59, 32)            6336      
_________________________________________________________________
gru_5 (GRU)                  (None, 32)                6336      
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 33        
=================================================================
Total params: 34,465
Trainable params: 34,465
Non-trainable params: 0
_________________________________________________________________
