Model: "sequential_75"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 62, 128)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 62, 128)           0         
_________________________________________________________________
conv1d_83 (Conv1D)           (None, 20, 64)            24640     
_________________________________________________________________
batch_normalization_74 (Batc (None, 20, 64)            256       
_________________________________________________________________
max_pooling1d_74 (MaxPooling (None, 4, 64)             0         
_________________________________________________________________
flatten_20 (Flatten)         (None, 256)               0         
_________________________________________________________________
dense_66 (Dense)             (None, 64)                16448     
_________________________________________________________________
dropout_46 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_67 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_47 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_68 (Dense)             (None, 1)                 33        
=================================================================
Total params: 43,457
Trainable params: 43,329
Non-trainable params: 128
_________________________________________________________________
