Model: "sequential_71"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 122, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 122, 64)           0         
_________________________________________________________________
conv1d_77 (Conv1D)           (None, 60, 32)            6176      
_________________________________________________________________
batch_normalization_69 (Batc (None, 60, 32)            128       
_________________________________________________________________
max_pooling1d_69 (MaxPooling (None, 60, 32)            0         
_________________________________________________________________
conv1d_78 (Conv1D)           (None, 29, 64)            6208      
_________________________________________________________________
batch_normalization_70 (Batc (None, 29, 64)            256       
_________________________________________________________________
max_pooling1d_70 (MaxPooling (None, 29, 64)            0         
_________________________________________________________________
conv1d_79 (Conv1D)           (None, 14, 128)           24704     
_________________________________________________________________
batch_normalization_71 (Batc (None, 14, 128)           512       
_________________________________________________________________
max_pooling1d_71 (MaxPooling (None, 14, 128)           0         
_________________________________________________________________
flatten_19 (Flatten)         (None, 1792)              0         
_________________________________________________________________
dense_62 (Dense)             (None, 64)                114752    
_________________________________________________________________
dropout_43 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_63 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_44 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_64 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_45 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_65 (Dense)             (None, 1)                 17        
=================================================================
Total params: 155,361
Trainable params: 154,913
Non-trainable params: 448
_________________________________________________________________
