Model: "sequential_116"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 16)           0         
_________________________________________________________________
conv1d_40 (Conv1D)           (None, 41, 64)            5184      
_________________________________________________________________
lstm_34 (LSTM)               (None, 41, 32)            12416     
_________________________________________________________________
lstm_35 (LSTM)               (None, 41, 32)            8320      
_________________________________________________________________
lstm_36 (LSTM)               (None, 41, 32)            8320      
_________________________________________________________________
lstm_37 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_39 (Dense)             (None, 1)                 33        
=================================================================
Total params: 42,593
Trainable params: 42,593
Non-trainable params: 0
_________________________________________________________________
