Model: "sequential_113"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 64)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 64)           0         
_________________________________________________________________
conv1d_39 (Conv1D)           (None, 62, 32)            6176      
_________________________________________________________________
bidirectional_42 (Bidirectio (None, 256)               164864    
_________________________________________________________________
dense_38 (Dense)             (None, 1)                 257       
=================================================================
Total params: 171,297
Trainable params: 171,297
Non-trainable params: 0
_________________________________________________________________
