Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 31, 32)            2080      
_________________________________________________________________
bidirectional_7 (Bidirection (None, 31, 64)            12672     
_________________________________________________________________
bidirectional_8 (Bidirection (None, 31, 64)            18816     
_________________________________________________________________
bidirectional_9 (Bidirection (None, 64)                18816     
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 65        
=================================================================
Total params: 52,449
Trainable params: 52,449
Non-trainable params: 0
_________________________________________________________________
