Model: "sequential_188"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 124, 32)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 124, 32)           0         
_________________________________________________________________
conv1d_195 (Conv1D)          (None, 61, 32)            3104      
_________________________________________________________________
batch_normalization_177 (Bat (None, 61, 32)            128       
_________________________________________________________________
max_pooling1d_177 (MaxPoolin (None, 61, 32)            0         
_________________________________________________________________
conv1d_196 (Conv1D)          (None, 30, 64)            6208      
_________________________________________________________________
batch_normalization_178 (Bat (None, 30, 64)            256       
_________________________________________________________________
max_pooling1d_178 (MaxPoolin (None, 30, 64)            0         
_________________________________________________________________
conv1d_197 (Conv1D)          (None, 14, 128)           24704     
_________________________________________________________________
batch_normalization_179 (Bat (None, 14, 128)           512       
_________________________________________________________________
max_pooling1d_179 (MaxPoolin (None, 14, 128)           0         
_________________________________________________________________
conv1d_198 (Conv1D)          (None, 6, 256)            98560     
_________________________________________________________________
batch_normalization_180 (Bat (None, 6, 256)            1024      
_________________________________________________________________
max_pooling1d_180 (MaxPoolin (None, 6, 256)            0         
_________________________________________________________________
flatten_52 (Flatten)         (None, 1536)              0         
_________________________________________________________________
dense_163 (Dense)            (None, 64)                98368     
_________________________________________________________________
dropout_111 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_164 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_112 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_165 (Dense)            (None, 16)                528       
_________________________________________________________________
dropout_113 (Dropout)        (None, 16)                0         
_________________________________________________________________
dense_166 (Dense)            (None, 1)                 17        
=================================================================
Total params: 235,489
Trainable params: 234,529
Non-trainable params: 960
_________________________________________________________________
