Model: "sequential_36"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_12 (Conv1D)           (None, 19, 32)            10272     
_________________________________________________________________
bidirectional_15 (Bidirectio (None, 19, 256)           124416    
_________________________________________________________________
bidirectional_16 (Bidirectio (None, 19, 256)           296448    
_________________________________________________________________
bidirectional_17 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 257       
=================================================================
Total params: 727,841
Trainable params: 727,841
Non-trainable params: 0
_________________________________________________________________
