Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_4 (Reshape)          (None, 1000, 16)          0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 1000, 32)          6272      
_________________________________________________________________
lstm_2 (LSTM)                (None, 1000, 32)          8320      
_________________________________________________________________
lstm_3 (LSTM)                (None, 1000, 32)          8320      
_________________________________________________________________
lstm_4 (LSTM)                (None, 32)                8320      
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 33        
=================================================================
Total params: 31,265
Trainable params: 31,265
Non-trainable params: 0
_________________________________________________________________
