{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"input_97:0": {"name": "input_97:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16000"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "257"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/zeros_like", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/floordiv_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_1/values_1/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/range_1/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/range_1/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_2/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Maximum/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame_step", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame_length", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/packed", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/hann_window/sub_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/rfft/fft_length", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/log_mel_spectrogram_96/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_201/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_201/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/batch_normalization_178/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/batch_normalization_178/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_192/max_pooling1d_178/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_202/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_202/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_192/batch_normalization_179/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/batch_normalization_179/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/max_pooling1d_179/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_192/flatten_48/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_97", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "16000"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Shape", "op": "Shape", "input": ["input_97"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/split", "op": "SplitV", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Shape", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/packed", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/split/split_dim"], "attr": {"Tlen": {"type": "DT_INT32"}, "num_split": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/split:1", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/floordiv_3", "op": "FloorDiv", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/floordiv_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame_length"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/floordiv_3", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_1/values_1", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/floordiv_3", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_1/values_1/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/floordiv", "op": "FloorDiv", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/sub_2", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame_step"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/mul"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/split", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_1/values_1", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/split:2", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/add/x", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/mul", "ConstantFolding/StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Maximum/x", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/add"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/split", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat/values_1", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/split:2", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/range_1", "op": "Range", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/range_1/start", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Maximum", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/range_1/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Maximum", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_2/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_2/values_1", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Maximum", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame_length"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/StridedSlice", "op": "StridedSlice", "input": ["input_97", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/zeros_like", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/ones_like"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/range_1", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_2", "op": "ConcatV2", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/split", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_2/values_1", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/split:2", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_2/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/StridedSlice", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_2", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_3"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_1", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/add_1", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/strided_slice"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_4", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/GatherV2", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_4", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/hann_window/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/rfft", "op": "RFFT", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/mul", "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/rfft/fft_length"], "attr": {"Treal": {"type": "DT_FLOAT"}, "Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/Abs", "op": "ComplexAbs", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/Abs"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Shape", "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/axes", "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Shape", "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/free", "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/GatherV2_1", "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/GatherV2", "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/GatherV2", "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Const_2", "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/concat_1/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Prod", "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/Abs", "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Reshape", "unknown"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/MatMul", "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/log_mel_spectrogram_96/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot", "StatefulPartitionedCall/sequential_192/DataPreprocessing/log_mel_spectrogram_96/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/log_mel_spectrogram_96/Log", "op": "Log", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/log_mel_spectrogram_96/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_201/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_192/DataPreprocessing/log_mel_spectrogram_96/Log", "StatefulPartitionedCall/sequential_192/conv1d_201/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_201/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_192/conv1d_201/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_192/conv1d_201/conv1d/ExpandDims_1", "unknown_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_201/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_192/conv1d_201/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_201/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_192/conv1d_201/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/batch_normalization_178/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_192/conv1d_201/Relu", "StatefulPartitionedCall/sequential_192/batch_normalization_178/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/batch_normalization_178/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_192/batch_normalization_178/batchnorm/mul_1", "StatefulPartitionedCall/sequential_192/batch_normalization_178/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/max_pooling1d_178/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_192/batch_normalization_178/batchnorm/add_1", "StatefulPartitionedCall/sequential_192/max_pooling1d_178/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/max_pooling1d_178/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_192/max_pooling1d_178/ExpandDims"], "attr": {"strides": {"list": {"i": ["1", "3", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "3", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/max_pooling1d_178/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_192/max_pooling1d_178/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_202/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_192/max_pooling1d_178/Squeeze", "StatefulPartitionedCall/sequential_192/conv1d_202/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_202/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_192/conv1d_202/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_192/conv1d_202/conv1d/ExpandDims_1", "unknown_7"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_202/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_192/conv1d_202/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_202/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_192/conv1d_202/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/batch_normalization_179/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_192/conv1d_202/Relu", "StatefulPartitionedCall/sequential_192/batch_normalization_179/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/batch_normalization_179/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_192/batch_normalization_179/batchnorm/mul_1", "StatefulPartitionedCall/sequential_192/batch_normalization_179/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/max_pooling1d_179/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_192/batch_normalization_179/batchnorm/add_1", "StatefulPartitionedCall/sequential_192/max_pooling1d_179/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/max_pooling1d_179/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_192/max_pooling1d_179/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "3", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "3", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_192/max_pooling1d_179/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_192/max_pooling1d_179/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_192/flatten_48/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_192/max_pooling1d_179/Squeeze", "StatefulPartitionedCall/sequential_192/flatten_48/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_192/dense_149/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_192/flatten_48/Reshape", "unknown_12", "unknown_13"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_192/dense_150/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_192/dense_149/Relu", "unknown_14", "unknown_15"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_192/dense_150/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_192/dense_150/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_192/dense_150/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "unknown", "shape": [257, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/zeros_like", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/mul/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/ones_like", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/floordiv_3/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_1/values_1/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/range_1/start", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/range_1/delta", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_2/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape_3", "shape": [1, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Maximum/x", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/add/x", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/Reshape/shape", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame_step", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame_length", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/packed", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat_2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/hann_window/sub_2", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/rfft/fft_length", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/mel_spectrogram_96/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/DataPreprocessing/log_mel_spectrogram_96/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_201/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_201/conv1d/ExpandDims_1", "shape": [1, 5, 64, 64], "dtype": "float32"}, {"name": "unknown_1", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_192/batch_normalization_178/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_192/batch_normalization_178/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_192/max_pooling1d_178/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_202/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/conv1d_202/conv1d/ExpandDims_1", "shape": [1, 5, 64, 128], "dtype": "float32"}, {"name": "unknown_7", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_192/batch_normalization_179/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_192/batch_normalization_179/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_192/max_pooling1d_179/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_192/flatten_48/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_12", "shape": [640, 64], "dtype": "float32"}, {"name": "unknown_13", "shape": [64], "dtype": "float32"}, {"name": "unknown_14", "shape": [64, 1], "dtype": "float32"}, {"name": "unknown_15", "shape": [1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_192/DataPreprocessing/spectrogram_96/stft/frame/concat/values_1_const_axis", "shape": [], "dtype": "int32"}]}]}