Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_3 (Reshape)          (None, 250, 64)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 62, 32)            6176      
_________________________________________________________________
bidirectional_2 (Bidirection (None, 62, 256)           124416    
_________________________________________________________________
bidirectional_3 (Bidirection (None, 62, 256)           296448    
_________________________________________________________________
bidirectional_4 (Bidirection (None, 62, 256)           296448    
_________________________________________________________________
bidirectional_5 (Bidirection (None, 256)               296448    
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 257       
=================================================================
Total params: 1,020,193
Trainable params: 1,020,193
Non-trainable params: 0
_________________________________________________________________
