Model: "sequential_174"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 16)           0         
_________________________________________________________________
conv1d_181 (Conv1D)          (None, 41, 32)            1568      
_________________________________________________________________
batch_normalization_164 (Bat (None, 41, 32)            128       
_________________________________________________________________
max_pooling1d_164 (MaxPoolin (None, 8, 32)             0         
_________________________________________________________________
flatten_48 (Flatten)         (None, 256)               0         
_________________________________________________________________
dense_151 (Dense)            (None, 64)                16448     
_________________________________________________________________
dropout_103 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_152 (Dense)            (None, 32)                2080      
_________________________________________________________________
dropout_104 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_153 (Dense)            (None, 1)                 33        
=================================================================
Total params: 20,257
Trainable params: 20,193
Non-trainable params: 64
_________________________________________________________________
