Model: "sequential_79"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 125, 16)           0         
_________________________________________________________________
DataAugmentation (Sequential (None, 125, 16)           0         
_________________________________________________________________
conv1d_87 (Conv1D)           (None, 61, 64)            5184      
_________________________________________________________________
batch_normalization_77 (Batc (None, 61, 64)            256       
_________________________________________________________________
max_pooling1d_77 (MaxPooling (None, 61, 64)            0         
_________________________________________________________________
flatten_21 (Flatten)         (None, 3904)              0         
_________________________________________________________________
dense_69 (Dense)             (None, 64)                249920    
_________________________________________________________________
dropout_48 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_70 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_49 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_71 (Dense)             (None, 1)                 33        
=================================================================
Total params: 257,473
Trainable params: 257,345
Non-trainable params: 128
_________________________________________________________________
