Model: "sequential_21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_8 (Reshape)          (None, 1000, 16)          0         
_________________________________________________________________
lstm_6 (LSTM)                (None, 128)               74240     
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 129       
=================================================================
Total params: 74,369
Trainable params: 74,369
Non-trainable params: 0
_________________________________________________________________
