Model: "sequential_41"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_17 (Conv1D)           (None, 20, 32)            6176      
_________________________________________________________________
gru_52 (GRU)                 (None, 20, 32)            6336      
_________________________________________________________________
gru_53 (GRU)                 (None, 20, 32)            6336      
_________________________________________________________________
gru_54 (GRU)                 (None, 32)                6336      
_________________________________________________________________
dense_17 (Dense)             (None, 1)                 33        
=================================================================
Total params: 25,217
Trainable params: 25,217
Non-trainable params: 0
_________________________________________________________________
