Model: "sequential_84"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
DataPreprocessing (Sequentia (None, 61, 64)            0         
_________________________________________________________________
DataAugmentation (Sequential (None, 61, 64)            0         
_________________________________________________________________
conv1d_28 (Conv1D)           (None, 30, 64)            12352     
_________________________________________________________________
bidirectional_35 (Bidirectio (None, 30, 256)           148992    
_________________________________________________________________
bidirectional_36 (Bidirectio (None, 30, 256)           296448    
_________________________________________________________________
bidirectional_37 (Bidirectio (None, 256)               296448    
_________________________________________________________________
dense_28 (Dense)             (None, 1)                 257       
=================================================================
Total params: 754,497
Trainable params: 754,497
Non-trainable params: 0
_________________________________________________________________
